
&НаСервере
&После("ЗаполнитьГрафикПлатежейНаСервере")
Процедура АБК_ЗаполнитьГрафикПлатежейНаСервере()
	
	#Область ТиповойКодСтаройВерсии  // 2.0.93.42
	ОчиститьИзмененияГрафика(Объект.ГрафикПлатежей);
	
	ПериодыПлана = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПериодыПлана,
		Объект.РасшифровкаОбязательстваБюджет.Выгрузить(,"ПериодПлана").ВыгрузитьКолонку("ПериодПлана"), Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПериодыПлана,
		Объект.РасшифровкаОбязательстваВнебюджет.Выгрузить(,"ПериодПлана").ВыгрузитьКолонку("ПериодПлана"), Истина);
	РеквизитыПериодов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ПериодыПлана, "ДатаНачала,ДатаОкончания");
	
	ТабЧастиОбязательств = Новый Массив;
	ТабЧастиОбязательств.Добавить("РасшифровкаОбязательстваБюджет");
	ТабЧастиОбязательств.Добавить("РасшифровкаОбязательстваВнебюджет");
	
	Для Каждого ТабЧасть Из ТабЧастиОбязательств Цикл
	
		Для Каждого СтрокаОбязательств Из Объект[ТабЧасть] Цикл
			
			Если СтрокаОбязательств.СуммаВВалютеБезусловная > 0 Тогда // Аванс.
				
				НоваяСтрока = Объект.ГрафикПлатежей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОбязательств,
					"КФО,КПС,КЭК,КодЦели,КодМероприятия,ДопКлассификация");
				
				НоваяСтрока.СуммаВВалюте = СтрокаОбязательств.СуммаВВалютеБезусловная;
				НоваяСтрока.СуммаВВалютеПослеИзменений =
					НоваяСтрока.СуммаВВалютеДоИзменений + НоваяСтрока.СуммаВВалюте;
				
				НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
					НоваяСтрока.КЭК, "302.00",, Объект.Дата, Объект.Организация, Объект.ИФО);
				
				// Дата оплаты по умолчанию - конец выбранного периода.
				НоваяСтрока.ОплатитьДо  = РеквизитыПериодов[СтрокаОбязательств.ПериодПлана].ДатаНачала;
				НоваяСтрока.ВидРасчетов = Перечисления.ВидыРасчетовПоЗаймам.ОсновнойДолг;
				
			КонецЕсли;
			
			Если СтрокаОбязательств.СуммаВВалюте - СтрокаОбязательств.СуммаВВалютеБезусловная > 0 Тогда // Оплата.
				
				НоваяСтрока = Объект.ГрафикПлатежей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОбязательств,
					"КФО,КПС,КЭК,КодЦели,КодМероприятия,ДопКлассификация");
				
				НоваяСтрока.СуммаВВалюте = СтрокаОбязательств.СуммаВВалюте - СтрокаОбязательств.СуммаВВалютеБезусловная;
				НоваяСтрока.СуммаВВалютеПослеИзменений =
					НоваяСтрока.СуммаВВалютеДоИзменений + НоваяСтрока.СуммаВВалюте;
				
				НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
					НоваяСтрока.КЭК, "302.00",, Объект.Дата, Объект.Организация, Объект.ИФО);
				
				// Дата оплаты по умолчанию - конец выбранного периода.
				НоваяСтрока.ОплатитьДо  = РеквизитыПериодов[СтрокаОбязательств.ПериодПлана].ДатаОкончания;
				НоваяСтрока.ВидРасчетов = Перечисления.ВидыРасчетовПоЗаймам.ОсновнойДолг;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Объект.ГрафикПлатежей.Сортировать("ОплатитьДо,ВидРасчетов,СчетРасчетов");
	#КонецОбласти
	
КонецПроцедуры

&НаСервере
&После("ЗаполнитьГрафикИсполненияНаСервере")
Процедура АБК_ЗаполнитьГрафикИсполненияНаСервере()
	
	#Область ТиповойКодСтаройВерсии  // 2.0.93.42
	ОчиститьИзмененияГрафика(Объект.ГрафикИсполнения);
	
	ПериодыПлана = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПериодыПлана,
		Объект.РасшифровкаОбязательстваБюджет.Выгрузить(,"ПериодПлана").ВыгрузитьКолонку("ПериодПлана"), Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПериодыПлана,
		Объект.РасшифровкаОбязательстваВнебюджет.Выгрузить(,"ПериодПлана").ВыгрузитьКолонку("ПериодПлана"), Истина);
	РеквизитыПериодов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ПериодыПлана, "ДатаНачала,ДатаОкончания");
	
	ТабЧастиОбязательств = Новый Массив;
	ТабЧастиОбязательств.Добавить("РасшифровкаОбязательстваБюджет");
	ТабЧастиОбязательств.Добавить("РасшифровкаОбязательстваВнебюджет");
	
	Для Каждого ТабЧасть Из ТабЧастиОбязательств Цикл
	
		Для Каждого СтрокаОбязательств Из Объект[ТабЧасть] Цикл
			
			Если СтрокаОбязательств.СуммаВВалюте > 0 Тогда
				
				НоваяСтрока = Объект.ГрафикИсполнения.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОбязательств,
					"КФО,КПС,КЭК");
				
				НоваяСтрока.СуммаВВалюте = СтрокаОбязательств.СуммаВВалюте;
				НоваяСтрока.СуммаВВалютеПослеИзменений =
					НоваяСтрока.СуммаВВалютеДоИзменений + НоваяСтрока.СуммаВВалюте;
				
				НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
					НоваяСтрока.КЭК, "302.00",, Объект.Дата, Объект.Организация, Объект.ИФО);
				
				// Дата исполнения по умолчанию - конец выбранного периода.
				НоваяСтрока.ИсполнитьДо = РеквизитыПериодов[СтрокаОбязательств.ПериодПлана].ДатаОкончания;
				//НоваяСтрока.ВидРасчетов = Перечисления.ВидыРасчетовПоЗаймам.ОсновнойДолг;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Объект.ГрафикИсполнения.Сортировать("ИсполнитьДо,СчетРасчетов");
	#КонецОбласти	
	
КонецПроцедуры
