
Функция  НайтиНеподписанныеВнутренниеЭДО() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подписант", ПараметрыСеанса.ТекущийПользователь);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоставМаршрутаЭлектронногоДокумента.ЭлектронныйДокумент КАК Документ,
	|	СоставМаршрутаЭлектронногоДокумента.Идентификатор КАК ИдентификаторСообщения
	|ИЗ
	|	РегистрСведений.СоставМаршрутаЭлектронногоДокумента КАК СоставМаршрутаЭлектронногоДокумента
	|ГДЕ
	|	НЕ СоставМаршрутаЭлектронногоДокумента.ЭлектронныйДокумент В
	|				(ВЫБРАТЬ
	|					СоставМаршрутаЭлектронногоДокумента.ЭлектронныйДокумент КАК ЭлектронныйДокумент
	|				ИЗ
	|					РегистрСведений.СоставМаршрутаЭлектронногоДокумента КАК СоставМаршрутаЭлектронногоДокумента
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВнутреннийЭлектронныйДокумент КАК ВнутреннийЭлектронныйДокумент
	|						ПО
	|							СоставМаршрутаЭлектронногоДокумента.ЭлектронныйДокумент = ВнутреннийЭлектронныйДокумент.Ссылка
	|				ГДЕ
	|					(СоставМаршрутаЭлектронногоДокумента.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовВнутреннегоЭДО.Аннулирован)
	|						ИЛИ ВнутреннийЭлектронныйДокумент.ПометкаУдаления)
	|				СГРУППИРОВАТЬ ПО
	|					СоставМаршрутаЭлектронногоДокумента.ЭлектронныйДокумент)
	|	И СоставМаршрутаЭлектронногоДокумента.Подписант = &Подписант
	|	И СоставМаршрутаЭлектронногоДокумента.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовВнутреннегоЭДО.ТребуетсяПодписание)";
		
	МассивДокументов = ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат МассивДокументов;
	
КонецФункции
