
&НаКлиенте
&ИзменениеИКонтроль("Подключаемый_ВыполнитьКоманду")
Процедура АБК_Подключаемый_ВыполнитьКоманду(Команда)

	#Вставка
	Если СтрНайти(Команда.Имя, "АБК_") И СтрНайти(Команда.Имя, "_НастройкаОтображенияДанныхИзТабличныхЧастей") Тогда
		ДинамическийСписок = СтрРазделить(Команда.Имя, "_")[1];  
		ТаблицаФормы_ПоКоманде = Элементы.Найти(ДинамическийСписок);
		Если ТаблицаФормы_ПоКоманде <> Неопределено Тогда
			ЭтотОбъект.ТекущийЭлемент = ТаблицаФормы_ПоКоманде;		
		КонецЕсли;
	КонецЕсли;
	#КонецВставки
	Если ТипЗнч(ЭтотОбъект.ТекущийЭлемент) = Тип("ТаблицаФормы") Тогда
		ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, ЭтотОбъект.ТекущийЭлемент);
	КонецЕсли;	

КонецПроцедуры
