
&НаСервере
&После("ПриСозданииНаСервере")
Процедура АБК_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобРеквизиты = Новый Массив;
	ДобРеквизиты.Добавить(Новый РеквизитФормы("АБК_ОтборНоменклатуры",Новый ОписаниеТипов("ТаблицаЗначений")));
	ДобРеквизиты.Добавить(Новый РеквизитФормы("АБК_Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"),
						"АБК_ОтборНоменклатуры","Номенклатура"));
	ДобРеквизиты.Добавить(Новый РеквизитФормы("АБК_Использовать",Новый ОписаниеТипов("Булево"),"АБК_ОтборНоменклатуры"));
	
	ИзменитьРеквизиты(ДобРеквизиты);
	
	нЭлемент = Элементы.Добавить("ГруппаОтборНоменклатуры",Тип("ГруппаФормы"),Элементы.СтраницаНастройки);
	нЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	нЭлемент.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	нЭлемент.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
    нЭлемент.Заголовок = "Отбор номенклатуры";
	
	нЭлемент = Элементы.Добавить("АБК_ОтборНоменклатуры",Тип("ТаблицаФормы"), Элементы.ГруппаОтборНоменклатуры);
	нЭлемент.ПутьКДанным = "АБК_ОтборНоменклатуры";
	
	нЭлемент = Элементы.Добавить("АБК_Использовать",Тип("ПолеФормы"),Элементы.АБК_ОтборНоменклатуры);
	нЭлемент.ПутьКДанным = "АБК_ОтборНоменклатуры.АБК_Использовать"; 
	нЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	нЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	
	нЭлемент = Элементы.Добавить("АБК_Номенклатура",Тип("ПолеФормы"),Элементы.АБК_ОтборНоменклатуры);
	нЭлемент.ПутьКДанным = "АБК_ОтборНоменклатуры.АБК_Номенклатура"; 
	нЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	
КонецПроцедуры
