
//&НаКлиенте
//&После("ДополнитьСтруктуруПодбора1")
//Процедура АБК_ДополнитьСтруктуруПодбора1(ПараметрыПодбора, ДополнительныйПараметр)
//	
//	ПоместитьТаблицуМатериалов(ПараметрыПодбора, ДополнительныйПараметр);
//	
//КонецПроцедуры

&НаСервере
Процедура ПоместитьТаблицуМатериалов(ПараметрыПодбора, ДополнительныйПараметр)
	
	ПодборМатериальныхЗапасов.ПоместитьТаблицаМатериалов(ПараметрыПодбора, ДополнительныйПараметр, Объект);	
	
КонецПроцедуры

&НаСервере
&Перед("ОбработатьВыборПодбораНаСервере")
Процедура АБК_ОбработатьВыборПодбораНаСервере(ВыбранноеЗначение)
	
	ИмяТабличнойЧасти = "";
	
	Если ПодборМатериальныхЗапасов.ПолучитьИмяТабличнойЧастиМатериалы(Объект, ИмяТабличнойЧасти) Тогда
		Объект[ИмяТабличнойЧасти].Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ДополнитьСтруктуруПодбора")
Функция АБК_ДополнитьСтруктуруПодбора()

	ПараметрыПодбора = Новый Структура;
	Если СчетУчета105(ЭтотОбъект) Тогда
		СписокСчетов = Новый СписокЗначений;
		СписокСчетов.Добавить(Объект.СчетУчета);
		СписокСчетов.Добавить(ОбщегоНазначенияБГУКлиентСервер.СвойствоЛокальногоКэшаФормы(ЭтотОбъект, "Счет113"));
		ПараметрыПодбора.Вставить("СчетУчета", СписокСчетов);
	Иначе
		ПараметрыПодбора.Вставить("СчетУчета",				Объект.СчетУчета);
	КонецЕсли;
	ПараметрыПодбора.Вставить("КФО",					Объект.КФО);
	ПараметрыПодбора.Вставить("ЦМО", 					Объект.ЦМООтправитель);
	ПараметрыПодбора.Вставить("Подразделение",			Объект.ПодразделениеОтправитель);
	ПараметрыПодбора.Вставить("ПоказыватьОстатки",		Истина);
	ПараметрыПодбора.Вставить("ПоказыватьСчетУчета", Истина);
	ТипыНоменклатуры = Новый СписокЗначений;
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Блюдо"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ГСМ"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Медикаменты"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МолоднякИЖивотныеНаОткорме"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МягкийИнвентарь"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Посуда"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПродуктыПитания"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Продукция"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Стройматериалы"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПрочиеМЗ"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Оборудование"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.БСО"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.БиологическиеАктивы"));
	ПараметрыПодбора.Вставить("ТипыНоменклатуры",		ТипыНоменклатуры);
	ПараметрыПодбора.Вставить("ИмяТаблицы",				"Материалы");

	Если СчетУчета27(ЭтотОбъект) Тогда
		ПараметрыПодбора.Вставить("ПодборОстатковВПользовании", Истина);
		ПараметрыПодбора.Вставить("СчетОстатковВПользовании", Объект.СчетУчета);
	КонецЕсли;

	Если Объект.ВыдатьВЛичноеПользование Тогда
		ПараметрыПодбора.Вставить("ВладелецНормыВыдачи", Объект.ПолучательИмущества);
	КонецЕсли;

	ДополнительноеСубконтоСчета = ОбщегоНазначенияБГУКлиентСервер.СвойствоЛокальногоКэшаФормы(ЭтотОбъект,
	"ДополнительноеСубконтоСчета");
	Если ЗначениеЗаполнено(ДополнительноеСубконтоСчета) Тогда
		ПараметрыПодбора.Вставить("ВидСубконтоДополнительнойАналитикиСчета", ДополнительноеСубконтоСчета);
	КонецЕсли;  
	#Вставка
	ПоместитьТаблицуМатериалов(ПараметрыПодбора, Неопределено);
	#КонецВставки
	Возврат ПараметрыПодбора;

КонецФункции
