
&НаКлиенте
&После("ДополнитьСтруктуруПодбора")
Процедура АБК_ДополнитьСтруктуруПодбора(ПараметрыПодбора, ДополнительныйПараметр)
	
	ПоместитьТаблицуМатериалов(ПараметрыПодбора, ДополнительныйПараметр);
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьТаблицуМатериалов(ПараметрыПодбора, ДополнительныйПараметр)
	
	ПодборМатериальныхЗапасов.ПоместитьТаблицаМатериалов(ПараметрыПодбора, ДополнительныйПараметр, Объект);	
	
КонецПроцедуры

&НаСервере
&Перед("ОбработатьВыборПодбораНаСервере")
Процедура АБК_ОбработатьВыборПодбораНаСервере(ВыбранноеЗначение)
	
	ИмяТабличнойЧасти = "";
	
	Если ПодборМатериальныхЗапасов.ПолучитьИмяТабличнойЧастиМатериалы(Объект, ИмяТабличнойЧасти) Тогда
		Объект[ИмяТабличнойЧасти].Очистить();
	КонецЕсли;
	
КонецПроцедуры
