Функция ПолучитьИмяРеквизитаДопКолонки(Форма, ИмяТЧ, ИмяДопКолонки) Экспорт  
	
	НайденныеСтроки = Форма.БухгалтерскиеОперации_ДобавленныеРеквизитыОперации.НайтиСтроки(Новый Структура("ИмяДляФормулы,ИмяТаблицы",ИмяДопКолонки,ИмяТЧ));
	ТЧ_ИФО = "";
	Если НайденныеСтроки.Количество() Тогда 
		ТЧ_ИФО = НайденныеСтроки[0].ИмяРеквизита;
	КонецЕсли;
	
	Возврат ТЧ_ИФО;
	
КонецФункции // ПолучитьИмяРеквизитаИФО()

Функция ОписаниеТипаИФО() Экспорт 
	Возврат Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения");
КонецФункции

