
&НаКлиенте
Процедура ПечатьПриказа(Команда)
	ТД=ВыполнениеПечатиНаСервере();
	ТД.Показать();
КонецПроцедуры

&НаСервере
Функция ВыполнениеПечатиНаСервере()
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Объект.СсылкаНаОбъект);
	ОбъектыПечати = Новый СписокЗначений;
	Об = РеквизитФормыВЗначение("Объект");
	
	Возврат Об.СформироватьПечатнуюФорму(МассивОбъектов,ОбъектыПечати,"ПФ_MXL_АктСписанияМЗ0504230_103н");  
КонецФункции

&НаСервере
Функция ВыполнениеПечати0510460НаСервере()
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Объект.СсылкаНаОбъект);
	ОбъектыПечати = Новый СписокЗначений;
	Об = РеквизитФормыВЗначение("Объект");
	
	Возврат Об.НапечататьАктОСписанииМЗ0510460(МассивОбъектов, ОбъектыПечати, Об.ДанныеДляПечатиАктаОСписанииМЗ0510460(МассивОбъектов));  
КонецФункции

&НаКлиенте
Процедура ВыполнениеПечати0510460(Команда)
	ТД=ВыполнениеПечати0510460НаСервере();
	ТД.Показать();
КонецПроцедуры
