
&НаСервере
Процедура АБК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	НовЭл = Элементы.Добавить("Комментарий",Тип("ПолеФормы"),ЭтаФорма);
	НовЭл.ПутьКДанным = "Объект.Комментарий";
	НовЭл.Вид = ВидПоляФормы.ПолеВвода;
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("УправлениеВидимостьюЭлементовФормы")
Процедура АБК_УправлениеВидимостьюЭлементовФормы()
	
	#Удаление
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы, "Записать", "Видимость", Объект.Ссылка.Пустая()); 
	#КонецУдаления

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы, "МаршрутПодписания", "Видимость", Объект.Ссылка.Пустая() И МаршрутИзНастройки.Пустая());

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы, "ПоказатьКомментарийСостояния", "Видимость", ЗначениеЗаполнено(ОписаниеСостояния));

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы, "ПредупреждениеАктуальность", "Видимость", НЕ ДокументАктуален);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы, "ПоказатьОтличия", "Видимость", НЕ ДокументАктуален);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы, "СохранитьДокумент", "Видимость", НЕ Объект.Ссылка.Пустая());

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы, "СохранитьДокументИПодписи", "Видимость", НЕ Объект.Ссылка.Пустая());

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы, "НеактуальныеДокументы", "Видимость", ЕстьНеактуальныеВерсии);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы, "ЗаписатьМаршрут", "Видимость",
	НЕ Объект.Ссылка.Пустая()
	И ПользователюРазрешеноИзменениеМаршрута()
	И (Состояние = ПредопределенноеЗначение("Перечисление.СостоянияДокументовВнутреннегоЭДО.ТребуетсяПодписание")
	ИЛИ Состояние = ПредопределенноеЗначение("Перечисление.СостоянияДокументовВнутреннегоЭДО.ТребуетсяУточнение")));

КонецПроцедуры
