
&НаСервере
Процедура АБК_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	
	Список.ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Регистратор,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ИФО КАК ИФО,
	|	ВЫБОР
	|		КОГДА &Дт208
	|			ТОГДА ВЫБОР
	|					КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаКт ЕСТЬ NULL
	|							ИЛИ ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаКт = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|							ИЛИ ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаКт = &ВалютаРуб
	|						ТОГДА &ВалютаРуб
	|					ИНАЧЕ ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаКт
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаДт ЕСТЬ NULL
	|						ИЛИ ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаДт = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|						ИЛИ ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаДт = &ВалютаРуб
	|					ТОГДА &ВалютаРуб
	|				ИНАЧЕ ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаДт
	|			КОНЕЦ
	|	КОНЕЦ КАК Валюта,
	|	СУММА(ВЫБОР
	|			КОГДА &Дт208
	|				ТОГДА ВЫБОР
	|						КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаКт ЕСТЬ NULL
	|								ИЛИ ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаКт = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|								ИЛИ ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаКт = &ВалютаРуб
	|							ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.Сумма
	|						ИНАЧЕ ЖурналПроводокЕПСБУДвиженияССубконто.ВалютнаяСуммаКт
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаДт ЕСТЬ NULL
	|							ИЛИ ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаДт = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|							ИЛИ ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаДт = &ВалютаРуб
	|						ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.Сумма
	|					ИНАЧЕ ЖурналПроводокЕПСБУДвиженияССубконто.ВалютнаяСуммаДт
	|				КОНЕЦ
	|		КОНЕЦ) КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Организация = &Организация
	|				И СчетДт В (&СчетаДт)
	|				И СчетКт В (&СчетаКт)
	|				И Активность
	|				И НЕ Регистратор ССЫЛКА Документ.ЗакрытиеГодаТехнологическое,
	|			,
	|			) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АвансовыйОтчет.Получено КАК АвансовыйОтчетПолучено
	|		ПО (ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор = АвансовыйОтчетПолучено.ДокументАванса)
	|			И (АвансовыйОтчетПолучено.Ссылка.Сотрудник = &Сотрудник)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АвансовыйОтчет.ОстатокПерерасход КАК АвансовыйОтчетПерерасход
	|		ПО (АвансовыйОтчетПерерасход.ДокументПерерасхода = ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор)
	|			И (АвансовыйОтчетПерерасход.Ссылка.Сотрудник = &Сотрудник)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АвансовыйОтчет.ОстатокПерерасход КАК АвансовыйОтчетОстаток
	|		ПО (АвансовыйОтчетОстаток.ДокументОстатка = ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор)
	|			И (АвансовыйОтчетОстаток.Ссылка.Сотрудник = &Сотрудник)
	|ГДЕ
	|	(&Дт208
	|				И ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1 = &Контрагент
	|			ИЛИ НЕ &Дт208
	|				И ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 = &Контрагент)
	|	И (&Дт208
	|				И (ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаКт ЕСТЬ NULL
	|					ИЛИ ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаКт = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|						И &Валюта = &ВалютаРуб
	|					ИЛИ ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаКт = &ВалютаРуб
	|					ИЛИ ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаКт = &Валюта)
	|			ИЛИ НЕ &Дт208
	|				И (ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаДт ЕСТЬ NULL
	|					ИЛИ ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаДт = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|						И &Валюта = &ВалютаРуб
	|					ИЛИ ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаДт = &ВалютаРуб
	|					ИЛИ ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаДт = &Валюта))
	|	И (АвансовыйОтчетПолучено.Ссылка ЕСТЬ NULL
	|			ИЛИ АвансовыйОтчетПолучено.Ссылка = &АвансовыйОтчет)
	|	И (АвансовыйОтчетПерерасход.Ссылка ЕСТЬ NULL
	|			ИЛИ АвансовыйОтчетПерерасход.Ссылка = &АвансовыйОтчет)
	|	И (АвансовыйОтчетОстаток.Ссылка ЕСТЬ NULL
	|			ИЛИ АвансовыйОтчетОстаток.Ссылка = &АвансовыйОтчет)
	|	И НЕ ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор В (&ИсключитьДокументы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор,
	|	ВЫБОР
	|		КОГДА &Дт208
	|			ТОГДА ВЫБОР
	|					КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаКт ЕСТЬ NULL
	|							ИЛИ ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаКт = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|							ИЛИ ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаКт = &ВалютаРуб
	|						ТОГДА &ВалютаРуб
	|					ИНАЧЕ ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаКт
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаДт ЕСТЬ NULL
	|						ИЛИ ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаДт = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|						ИЛИ ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаДт = &ВалютаРуб
	|					ТОГДА &ВалютаРуб
	|				ИНАЧЕ ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаДт
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ИФО";
	
	НовЭл = Элементы.Добавить("СписокИФО", Тип("ПолеФормы"), Элементы.Список);
	НовЭл.ПутьКДанным = "Список.ИФО";
	НовЭл.Вид = ВидПоляФормы.ПолеВвода;
	
	Если Параметры.Кт208 Тогда
		СчетаДт = БухгалтерскийУчет.СписокСчетов("201.00,210.00,304.00,000");
		СчетаКт = БухгалтерскийУчет.СписокСчетов("208.00");
	Иначе
		СчетаДт = БухгалтерскийУчет.СписокСчетов("208.00");
		СчетаКт = БухгалтерскийУчет.СписокСчетов("201.00,210.00,304.00,000");
	КонецЕсли;
	
	//АпогейБК
	//Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
	//	
	//	СхемаЗапроса = Новый СхемаЗапроса;
	//	СхемаЗапроса.УстановитьТекстЗапроса(Список.ТекстЗапроса);
	//	
	//	ТекстВыражения = Строка(СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Источники[0].Источник.Параметры[2].Выражение);
	//	ТекстВыражения = ТекстВыражения + "
	//	|И ИФО = &ИФО";
	//	СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Источники[0].Источник.Параметры[2].Выражение = Новый ВыражениеСхемыЗапроса(ТекстВыражения); 
	//	
	//	Список.ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	//	
	//	Список.Параметры.УстановитьЗначениеПараметра("ИФО", Параметры.ИФО);
	//	
	//КонецЕсли;  
	//АпогейБК
	
	Если ЗначениеЗаполнено(Параметры.НачалоПериода)
		И ЗначениеЗаполнено(Параметры.КонецПериода)
		И Параметры.КонецПериода < Параметры.НачалоПериода Тогда
		Параметры.КонецПериода = Дата(1,1,1);
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("НачалоПериода", 		Параметры.НачалоПериода);
	Список.Параметры.УстановитьЗначениеПараметра("КонецПериода", 		Параметры.КонецПериода);
	Список.Параметры.УстановитьЗначениеПараметра("Организация", 		Параметры.Организация);
	Список.Параметры.УстановитьЗначениеПараметра("Сотрудник", 			Параметры.Сотрудник);
	Список.Параметры.УстановитьЗначениеПараметра("Контрагент", 			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Сотрудник, "Контрагент"));
	Список.Параметры.УстановитьЗначениеПараметра("ВалютаРуб", 			БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета());
	Список.Параметры.УстановитьЗначениеПараметра("Валюта", 				Параметры.Валюта);
	Список.Параметры.УстановитьЗначениеПараметра("Дт208", 				НЕ Параметры.Кт208);
	Список.Параметры.УстановитьЗначениеПараметра("СчетаДт", 			СчетаДт);
	Список.Параметры.УстановитьЗначениеПараметра("СчетаКт", 			СчетаКт);
	Список.Параметры.УстановитьЗначениеПараметра("ИсключитьДокументы",	Параметры.ИсключитьДокументы);
	Список.Параметры.УстановитьЗначениеПараметра("АвансовыйОтчет",		Параметры.АвансовыйОтчет);
	
	ЭтаФорма.Заголовок = Параметры.ЗаголовокФормы + " (" + Параметры.Сотрудник + ")";
	
	ПериодС 	= Параметры.НачалоПериода;
	ПериодПо 	= Параметры.КонецПериода;
	
КонецПроцедуры

&НаКлиенте
Процедура АБК_СписокВыборВместо(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОповеститьОВыборе(Новый Структура("ДокументАванса, Валюта, Сумма, ИФО", Элементы.Список.ТекущиеДанные.Регистратор, Элементы.Список.ТекущиеДанные.Валюта, Элементы.Список.ТекущиеДанные.Сумма, Элементы.Список.ТекущиеДанные.ИФО));
КонецПроцедуры

&НаКлиенте
Процедура АБК_СписокВыборЗначенияВместо(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОповеститьОВыборе(Новый Структура("ДокументАванса, Валюта, Сумма, ИФО", Элементы.Список.ТекущиеДанные.Регистратор, Элементы.Список.ТекущиеДанные.Валюта, Элементы.Список.ТекущиеДанные.Сумма, Элементы.Список.ТекущиеДанные.ИФО));
КонецПроцедуры
