
&После("ИзменитьСуммыНаПроцент")
Процедура АБК_УчетСтудентов4014хИзменитьСуммыНаПроцент(ДокументОбъект)
	АБК_ПересчитатьСуммыИзменений(ДокументОбъект);
КонецПроцедуры

&После("РаспределитьСуммуПоПериодам")
Процедура АБК_УчетСтудентов4014хРаспределитьСуммуПоПериодам(ДокументОбъект)
	АБК_ПересчитатьСуммыИзменений(ДокументОбъект);
КонецПроцедуры

Процедура АБК_ПересчитатьСуммыИзменений(ДокументОбъект)
	
	ИспользуетсяУчет4014х = АБК_УчетСтудентов.ИспользуетсяУчет4014х();
	Счет40141 = БухгалтерскиеОперации.СчетПоКоду("401.41", ДокументОбъект.Дата);
	
	Для Каждого СтрокаДБП Из ДокументОбъект.ДоходыБудущихПериодов Цикл
		СтрокаДБП.Всего = ДокументОбъект.СуммаРаспределенная;
		Если ИспользуетсяУчет4014х тогда
			СтрокаДБП.Всего = 0;
			Для Каждого Строка из ДокументОбъект.ПорядокОплаты цикл
				Если СтрокаДБП.СчетДБП = Счет40141 
					И Строка.КонецПериода <= КонецГода(ДокументОбъект.Дата) тогда
					СтрокаДБП.Всего = СтрокаДБП.Всего + Строка.СуммаВВалюте;
				ИначеЕсли СтрокаДБП.СчетДБП <> Счет40141 
					И Строка.КонецПериода >= КонецГода(ДокументОбъект.Дата) тогда
					СтрокаДБП.Всего = СтрокаДБП.Всего + Строка.СуммаВВалюте;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
