
&НаСервере
Процедура АБК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)     
	
	Если Элементы.Найти("СписокИФО") = Неопределено Тогда
		
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса,
		"ВЫБРАТЬ
		|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Регистратор",
		"ВЫБРАТЬ
		|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Регистратор,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ИФО КАК ИФО");    
		
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса,
		"СГРУППИРОВАТЬ ПО
		|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор",
		"СГРУППИРОВАТЬ ПО
		|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ИФО");   
		
		НовЭл = Элементы.Вставить("СписокИФО",Тип("ПолеФормы"),Элементы.Список,Элементы.Валюта);
		НовЭл.ПутьКДанным = "Список.ИФО";
		НовЭл.Вид = ВидПоляФормы.ПолеВвода;   
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
			Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "ИФО = &ИФО", "ИСТИНА");	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АБК_СписокВыборВместо(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОповеститьОВыборе(Новый Структура("ДокументАванса, Валюта, Сумма, ИФО", Элементы.Список.ТекущиеДанные.Регистратор, Элементы.Список.ТекущиеДанные.Валюта, Элементы.Список.ТекущиеДанные.Сумма, Элементы.Список.ТекущиеДанные.ИФО));
КонецПроцедуры

&НаКлиенте
Процедура АБК_СписокВыборЗначенияВместо(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОповеститьОВыборе(Новый Структура("ДокументАванса, Валюта, Сумма, ИФО", Элементы.Список.ТекущиеДанные.Регистратор, Элементы.Список.ТекущиеДанные.Валюта, Элементы.Список.ТекущиеДанные.Сумма, Элементы.Список.ТекущиеДанные.ИФО));
КонецПроцедуры

