
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ТаблицаПользователей.Видимость = Ложь;
	
	Элементы.Класс.СписокВыбора.Добавить("Справочники").Картинка = БиблиотекаКартинок.Справочник;
	Элементы.Класс.СписокВыбора.Добавить("Документы").Картинка = БиблиотекаКартинок.Документ; 
	Элементы.Класс.СписокВыбора.Добавить("ЖурналыДокументов", "Журналы документов").Картинка = БиблиотекаКартинок.ЖурналДокументов;
	Элементы.Класс.СписокВыбора.Добавить("Отчеты").Картинка = БиблиотекаКартинок.Отчет;
	Элементы.Класс.СписокВыбора.Добавить("Обработки").Картинка = БиблиотекаКартинок.Обработка;
	Элементы.Класс.СписокВыбора.Добавить("ПланыВидовХарактеристик", "Планы видов характеристик").Картинка = БиблиотекаКартинок.ПланВидовХарактеристик;
	Элементы.Класс.СписокВыбора.Добавить("ПланыСчетов", "Планы счетов").Картинка = БиблиотекаКартинок.ПланСчетов;
	Элементы.Класс.СписокВыбора.Добавить("ПланыВидовРасчета", "Планы видов расчета").Картинка = БиблиотекаКартинок.ПланВидовРасчета;
	Элементы.Класс.СписокВыбора.Добавить("РегистрыСведений", "Регистры сведений").Картинка = БиблиотекаКартинок.РегистрСведений;
	Элементы.Класс.СписокВыбора.Добавить("РегистрыНакопления", "Регистры накопления").Картинка = БиблиотекаКартинок.РегистрНакопления;
	Элементы.Класс.СписокВыбора.Добавить("РегистрыБухгалтерии", "Регистры бухгалтерии").Картинка = БиблиотекаКартинок.РегистрБухгалтерии;
	Элементы.Класс.СписокВыбора.Добавить("РегистрыРасчета", "Регистры расчета").Картинка = БиблиотекаКартинок.РегистрРасчета;
	Элементы.Класс.СписокВыбора.Добавить("Бизнес-процессы", "Бизнес-процессы").Картинка = БиблиотекаКартинок.БизнесПроцесс;
	Элементы.Класс.СписокВыбора.Добавить("Задачи", "Задачи").Картинка = БиблиотекаКартинок.Задача;
	Элементы.Класс.СписокВыбора.Добавить("ВнешниеИсточникиДанных", "Внешние источники данных").Картинка = БиблиотекаКартинок.ВнешнийИсточникДанных;
	
КонецПроцедуры

&НаСервере
Процедура КлассПриИзмененииНаСервере()
	
	Элементы.МетаданныеОбъект.СписокВыбора.Очистить();
	МетаданныеОбъект = "";
	
	Для Каждого Элемент Из Метаданные[Класс] Цикл 
		Элементы.МетаданныеОбъект.СписокВыбора.Добавить(Элемент.Имя, Элемент.Синоним);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КлассПриИзменении(Элемент)
	КлассПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура МетаданныеОбъектПриИзмененииНаСервере()
	
	КоллекцияОбъектовМетаданных = Метаданные[Класс];
	ОбъектМетаданных = КоллекцияОбъектовМетаданных[МетаданныеОбъект];
	
	ТаблицаРолей.Очистить();
	Права = ДанныеФормыВЗначение(ТаблицаРолей, Тип("ТаблицаЗначений")).Колонки;
	Права.Удалить("Роль");
	Права.Удалить("ИмяРоли");
	
	СтруктураЗаполнения = Новый Структура;
	Для Каждого Элемент Из Права Цикл 
		СтруктураЗаполнения.Вставить(Элемент.Имя);	
	КонецЦикла;
	
	Для Каждого Роль Из Метаданные.Роли Цикл 
		Для Каждого ЭлементСтруктуры Из СтруктураЗаполнения Цикл
			Попытка
			СтруктураЗаполнения[ЭлементСтруктуры.Ключ] = ПравоДоступа(ЭлементСтруктуры.Ключ,
																ОбъектМетаданных, 
																Роль);
			Исключение
			СтруктураЗаполнения[ЭлементСтруктуры.Ключ] = Ложь;	
			КонецПопытки;	
		КонецЦикла;
		
		Если СтруктураЗаполнения.Чтение Или СтруктураЗаполнения.Добавление Или СтруктураЗаполнения.Изменение 
			Или СтруктураЗаполнения. Удаление Или СтруктураЗаполнения.Проведение Или СтруктураЗаполнения.ОтменаПроведения 
			Или СтруктураЗаполнения.Просмотр Или  СтруктураЗаполнения.ИнтерактивноеДобавление 
			Или СтруктураЗаполнения.Редактирование Или  СтруктураЗаполнения.ИнтерактивноеУдаление Или  СтруктураЗаполнения.ИнтерактивнаяПометкаУдаления
			Или СтруктураЗаполнения.ИнтерактивноеСнятиеПометкиУдаления Или  СтруктураЗаполнения.ИнтерактивноеПроведение 
			Или СтруктураЗаполнения.ИнтерактивноеПроведениеНеОперативное Или  СтруктураЗаполнения.ИнтерактивнаяОтменаПроведения  
			Тогда
			НоваяСтрока = ТаблицаРолей.Добавить();
			НоваяСтрока.Роль = Роль.Синоним;
			НоваяСтрока.ИмяРоли = Роль.Имя;
			Для Каждого Колонка Из Права Цикл
				НоваяСтрока[Колонка.Имя] = СтруктураЗаполнения[Колонка.Имя];		
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура МетаданныеОбъектПриИзменении(Элемент)
	МетаданныеОбъектПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция СтандартныеПодсистемыСуществуют()
	
	Попытка
		БСП = СтандартныеПодсистемыСервер;
		Возврат Истина;
	Исключение
		Возврат Ложь
	КонецПопытки;
	
КонецФункции

&НаСервере
Процедура ТаблицаРолейПриАктивизацииСтрокиНаСервере(НаименованиеРоли)
	                                                       
	Роль = Метаданные.Роли.Найти(НаименованиеРоли);	
	
	МассивПользователей = ПользователиИнформационнойБазы.ПолучитьПользователей();
	
	Если СтандартныеПодсистемыСуществуют() Тогда
		Для Каждого Элемент Из МассивПользователей Цикл 
			Если Элемент.Роли.Содержит(Роль) Тогда
				ТаблицаПользователей.Добавить().Пользователь = Справочники.Пользователи.НайтиПоНаименованию(Элемент.ПолноеИмя);		
			КонецЕсли;
		КонецЦикла;			
	Иначе
		Для Каждого Элемент Из МассивПользователей Цикл 
			Если Элемент.Роли.Содержит(Роль) Тогда
				ТаблицаПользователей.Добавить().Пользователь = Элемент.Элемент.ПолноеИмя;		
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;
	
	Если ТаблицаПользователей.Количество() Тогда 
		Элементы.ТаблицаПользователей.Видимость = Истина;
	Иначе 
		Элементы.ТаблицаПользователей.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРолейПриАктивизацииСтроки(Элемент)
	
	ТаблицаПользователей.Очистить();
	ТаблицаПрофилиДоступа.Очистить();
	
	Если Элемент.ТекущиеДанные<>Неопределено Тогда 
		ТаблицаРолейПриАктивизацииСтрокиНаСервере(Элемент.ТекущиеДанные.ИмяРоли);
	КонецЕсли;
	
КонецПроцедуры
