
&ИзменениеИКонтроль("УправлениеЭлементамиЗачетаАвансов")
Процедура АБК_УправлениеЭлементамиЗачетаАвансов(Форма, Знач Объект)

	Если Объект = Неопределено Тогда
		Объект = Форма.Объект;
	КонецЕсли;
	Элементы = Форма.Элементы;

	Если Объект.СпособЗачетаАванса = ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.ПоДокументу") Тогда
		Элементы.ЗачетАвансов_Страницы.ТекущаяСтраница = Элементы.ЗачетАвансов_Страница;
		Элементы.ЗачетАванса.Доступность = Истина;
		Элементы.ЗачетАвансов_Страницы.ТолькоПросмотр = Ложь;
	ИначеЕсли Объект.СпособЗачетаАванса = ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.Автоматически") Тогда
		Элементы.ЗачетАвансов_Страницы.ТекущаяСтраница = Элементы.ЗачетАвансов_ПустаяСтраница;
		Элементы.ЗачетАванса.Доступность = Истина;
		Элементы.ЗачетАвансов_Страницы.ТолькоПросмотр = Истина;      
		#Вставка
	ИначеЕсли Объект.СпособЗачетаАванса = ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.ПоДокументамИОстаткам") Тогда
		Элементы.ЗачетАвансов_Страницы.ТекущаяСтраница = Элементы.ЗачетАвансовПоДокументамИОстаткам_Страница;
		Элементы.ЗачетАвансовПоДокументамИОстаткам.Доступность = Истина;
		Элементы.ЗачетАвансов_Страницы.ТолькоПросмотр = Ложь;
		#КонецВставки
	Иначе
		Элементы.ЗачетАванса.Доступность = ЛОЖЬ;
		Элементы.ЗачетАвансов_Страницы.ТолькоПросмотр = Истина;
	КонецЕсли;

КонецПроцедуры
