
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АдресРезультатовРасчета") Тогда
		ТаблицаРасчета.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресРезультатовРасчета));
		ТаблицаДетейДляВывода = ТаблицаРасчета.Выгрузить(,"Ребенок");
		ТаблицаДетейДляВывода.Свернуть("Ребенок");
		ТаблицаДетей.Загрузить(ТаблицаДетейДляВывода);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДетейПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаДетей.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Элементы.ТаблицаРасчета.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("Ребенок",ТекущиеДанные.Ребенок));	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДетейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРасчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

