
&НаСервере
Процедура АБК_УчетСтудентов4014хПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИспользоватьУчетСтудентов4014х", Новый ОписаниеТипов("Булево")));
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты, Новый Массив);
	
	Элемент = Элементы.Добавить("ИспользоватьУчетСтудентов4014х", Тип("ПолеФормы"), Элементы.ГруппаУчетРасчетовсоСтудентами);
	Элемент.Вид = ВидПоляФормы.ПолеФлажка;
	Элемент.Заголовок = "Использовать учет студентов по счетам 401.4х";
	Элемент.ПутьКДанным = "ИспользоватьУчетСтудентов4014х";
	Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	Элемент.РасширеннаяПодсказка.Заголовок = "Включает учет студентов по счетам 401.41 и 401.49";
	Элемент.УстановитьДействие("ПриИзменении", "АБК_ИспользоватьУчетСтудентов4014хПриИзменении");
	
	ЭтаФорма.ИспользоватьУчетСтудентов4014х = Константы.АБК_УчетСтудентов4014х.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура АБК_ИспользоватьУчетСтудентов4014хПриИзменении(Элемент)                            
	
	УстановитьЗначениеИспользоватьУчетСтудентов4014х(ЭтаФорма.ИспользоватьУчетСтудентов4014х);
	
	АБК_УчетСтудентовКлиент.ОбработатьИзменение_УчетСтудентов4014х();	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЗначениеИспользоватьУчетСтудентов4014х(Значение)
	Константы.АБК_УчетСтудентов4014х.Установить(Значение);
КонецПроцедуры