
&НаСервере
&ИзменениеИКонтроль("ВывестиПредставлениеДокумента")
Процедура АБК_ЭлектронныеИнвентарныеКарточки_ВывестиПредставлениеДокумента()

	Если Объект.Ссылка.Пустая()
		И НЕ ЗначениеЗаполнено(АдресОсновногоФайла) Тогда
		Возврат;
	КонецЕсли;

	ДвоичныеДанные = ДвоичныеДанныеЭлектронногоДокумента();

	Если ДвоичныеДанные = Неопределено Тогда

		ТабличныйДокументОсновной.Очистить();
		АдресОсновногоФайла = "";
		АдресТабличногоДокумента = "";

		ТекстСообщения = НСтр("ru = 'Не удалось получить данные документа, так как он помечен на удаление.
		|Для продолжения работы с документом необходимо снять пометку удаления.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

		Возврат;

	КонецЕсли;

	АдресОсновногоФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
    #Удаление
	ТабличныйДокументОсновной = ВнутреннийЭДО.ТабличныйДокументИзДвоичныхДанныхАрхива(ДвоичныеДанные);

	АдресТабличногоДокумента = ПоместитьВоВременноеХранилище(ТабличныйДокументОсновной, УникальныйИдентификатор);

	ВнутреннийЭДО.ДобавитьШтампыЭлектронныхПодписей(ТабличныйДокументОсновной, ЭлектронныеПодписи, Объект.Организация);
    #КонецУдаления
    #Вставка
    Если Объект.ИдентификаторКомандыПечати = "ИнвентарнаяКарточка61н" Тогда
    	ВремТабДокумент = ВнутреннийЭДО.ТабличныйДокументИзДвоичныхДанныхАрхива(ДвоичныеДанные);
    	ТабличныеДокументыСтраницы = Новый Массив;
    	
    	Для Каждого Обл из ВремТабДокумент.Области Цикл
    		Если СтрНайти(Обл.Имя, "Документ_") <> 0 Тогда
    			ТабличныеДокументыСтраницы.Добавить(ВремТабДокумент.ПолучитьОбласть(Обл.Имя));
    		КонецЕсли;
    	КонецЦикла;
    	
    	ТабличныйДокументОсновной.Очистить();
    	Для Каждого ТабДокументСтраница из ТабличныеДокументыСтраницы Цикл
    		ТабДокументСтраница.Область(
    			ТабДокументСтраница.ВысотаТаблицы,,
    			ТабДокументСтраница.ВысотаТаблицы).КонецСтраницы = ЛОЖЬ;
    			
    		ВнутреннийЭДО.ДобавитьШтампыЭлектронныхПодписей(ТабДокументСтраница, ЭлектронныеПодписи, Объект.Организация);
    		ТабДокументСтраница.Область(
    			ТабДокументСтраница.ВысотаТаблицы,,
    			ТабДокументСтраница.ВысотаТаблицы).КонецСтраницы = ИСТИНА;
    		ТабличныйДокументОсновной.Вывести(ТабДокументСтраница);	
    	КонецЦикла;
    Иначе
		ТабличныйДокументОсновной = ВнутреннийЭДО.ТабличныйДокументИзДвоичныхДанныхАрхива(ДвоичныеДанные);
		АдресТабличногоДокумента = ПоместитьВоВременноеХранилище(ТабличныйДокументОсновной, УникальныйИдентификатор);
		ВнутреннийЭДО.ДобавитьШтампыЭлектронныхПодписей(ТабличныйДокументОсновной, ЭлектронныеПодписи, Объект.Организация);
    КонецЕсли;
    
    #КонецВставки
КонецПроцедуры
