
&ИзменениеИКонтроль("ТаблицаДенежныхОбязательствПоЗаявке")
Функция АБК_ТаблицаДенежныхОбязательствПоЗаявке(ЗаявкаСсылка)

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Регистратор", ЗаявкаСсылка);
	Запрос.УстановитьПараметр("ВалютаРегУчета", БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета());
	Запрос.УстановитьПараметр("Счет50211", БухгалтерскийУчет.СписокСчетов("502.11, 502.21"));
	Запрос.УстановитьПараметр("Счет50212", БухгалтерскийУчет.СписокСчетов("502.12, 502.22"));

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ДвиженияССубконто.ПодразделениеКт ЕСТЬ NULL
	|				ИЛИ ДвиженияССубконто.ПодразделениеКт = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|			ТОГДА ДвиженияССубконто.ПодразделениеДт
	|		ИНАЧЕ ДвиженияССубконто.ПодразделениеКт
	|	КОНЕЦ КАК Подразделение,
	|	ДвиженияССубконто.КФО КАК КФО,  
	#Вставка     
	|	ДвиженияССубконто.ИФО КАК ИФО,
	#КонецВставки
	|	ДвиженияССубконто.КПСКт КАК КПС,
	|	ДвиженияССубконто.КЭККт КАК КЭК,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт1) = ТИП(Справочник.ВидыЦелевыхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт1 КАК Справочник.ВидыЦелевыхСредств)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт2) = ТИП(Справочник.ВидыЦелевыхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт2 КАК Справочник.ВидыЦелевыхСредств)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт3) = ТИП(Справочник.ВидыЦелевыхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт3 КАК Справочник.ВидыЦелевыхСредств)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт1) = ТИП(Справочник.ВидыЦелевыхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт1 КАК Справочник.ВидыЦелевыхСредств)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт2) = ТИП(Справочник.ВидыЦелевыхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт2 КАК Справочник.ВидыЦелевыхСредств)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт3) = ТИП(Справочник.ВидыЦелевыхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт3 КАК Справочник.ВидыЦелевыхСредств)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЦелевыхСредств.ПустаяСсылка)
	|	КОНЕЦ КАК КодЦели,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт1) = ТИП(Справочник.Мероприятия)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт1 КАК Справочник.Мероприятия)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт2) = ТИП(Справочник.Мероприятия)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт2 КАК Справочник.Мероприятия)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт3) = ТИП(Справочник.Мероприятия)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт3 КАК Справочник.Мероприятия)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт1) = ТИП(Справочник.Мероприятия)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт1 КАК Справочник.Мероприятия)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт2) = ТИП(Справочник.Мероприятия)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт2 КАК Справочник.Мероприятия)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт3) = ТИП(Справочник.Мероприятия)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт3 КАК Справочник.Мероприятия)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Мероприятия.ПустаяСсылка)
	|	КОНЕЦ КАК КодМероприятия,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт1) = ТИП(Справочник.ДополнительнаяБюджетнаяКлассификация)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт1 КАК Справочник.ДополнительнаяБюджетнаяКлассификация)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт2) = ТИП(Справочник.ДополнительнаяБюджетнаяКлассификация)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт2 КАК Справочник.ДополнительнаяБюджетнаяКлассификация)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт3) = ТИП(Справочник.ДополнительнаяБюджетнаяКлассификация)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт3 КАК Справочник.ДополнительнаяБюджетнаяКлассификация)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт1) = ТИП(Справочник.ДополнительнаяБюджетнаяКлассификация)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт1 КАК Справочник.ДополнительнаяБюджетнаяКлассификация)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт2) = ТИП(Справочник.ДополнительнаяБюджетнаяКлассификация)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт2 КАК Справочник.ДополнительнаяБюджетнаяКлассификация)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт3) = ТИП(Справочник.ДополнительнаяБюджетнаяКлассификация)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт3 КАК Справочник.ДополнительнаяБюджетнаяКлассификация)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДополнительнаяБюджетнаяКлассификация.ПустаяСсылка)
	|	КОНЕЦ КАК ДопКлассификация,
	|	ВЫБОР
	|		КОГДА ДвиженияССубконто.ВалютаКт ЕСТЬ NULL
	|				ИЛИ ДвиженияССубконто.ВалютаКт = &ВалютаРегУчета
	|			ТОГДА """"
	|		ИНАЧЕ ДвиженияССубконто.ВалютаКт
	|	КОНЕЦ КАК Валюта,
	|	ВЫБОР
	|		КОГДА ДвиженияССубконто.ВалютаКт ЕСТЬ NULL
	|				ИЛИ ДвиженияССубконто.ВалютаКт = &ВалютаРегУчета
	|			ТОГДА ДвиженияССубконто.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ДвиженияССубконто.ВалютаКт ЕСТЬ NULL
	|				ИЛИ ДвиженияССубконто.ВалютаКт = &ВалютаРегУчета
	|			ТОГДА 0
	|		ИНАЧЕ ДвиженияССубконто.ВалютнаяСуммаКт
	|	КОНЕЦ КАК СуммаВВалюте
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|			,
	|			,
	|			СчетДт В (&Счет50211)
	|				И СчетКт В (&Счет50212)
	|				И Регистратор В (&Регистратор),
	|			,
	|			) КАК ДвиженияССубконто";

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции
