
&НаСервере
Процедура ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
    
    Свойство = НайтиСоздатьДополнительноеСведение("АБК_КПС");
    
    Если ЗначениеЗаполнено(Свойство) Тогда
      НЗ = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();
      НЗ.Отбор.Объект.Установить(Объект.Ссылка);
      НЗ.Отбор.Свойство.Установить(Свойство);
      НЗ.Прочитать();
      ТЧРеквизитов = НЗ.Выгрузить();
      
	  Если ТЧРеквизитов.Количество() И ЗначениеЗаполнено(ТЧРеквизитов[0].Значение) Тогда
	    
	    АБК_КПС = ЗначениеИзСтрокиВнутр(ТЧРеквизитов[0].Значение);  
	    
	  КонецЕсли;
      
    КонецЕсли;  
    
  КонецЕсли;

КонецПроцедуры
&НаСервере
Процедура ЗаписатьЗначениеДопРеквизитаСФормы(СсылкаНаВладельца,ЗначениеРеквизита,ИдентификаторДляФормул)
  
  Свойство = НайтиСоздатьДополнительноеСведение(ИдентификаторДляФормул);
  
  Если ЗначениеЗаполнено(Свойство) И ЗначениеЗаполнено(СсылкаНаВладельца) Тогда
    
    МЗ = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
    МЗ.Объект     = СсылкаНаВладельца;
    МЗ.Свойство   = Свойство;
    МЗ.Значение   = ЗначениеВСтрокуВнутр(ЗначениеРеквизита);
    МЗ.Записать();
    
  КонецЕсли; 
  
КонецПроцедуры

Функция НайтиСоздатьДополнительноеСведение(ИдентификаторДляФормул)
    
  Запрос = Новый Запрос;
  Запрос.УстановитьПараметр("ИдентификаторДляФормул", ИдентификаторДляФормул);
  Запрос.Текст = 
  "ВЫБРАТЬ
  |  ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
  |ИЗ
  |  ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
  |ГДЕ
  |  ДополнительныеРеквизитыИСведения.ИдентификаторДляФормул = &ИдентификаторДляФормул";
  Выборка = Запрос.Выполнить().Выбрать();
  
  Если Выборка.Следующий() тогда
    Возврат Выборка.Ссылка;
  КонецЕсли;
  
  ДопСведение = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
  ДопСведение.Наименование = ИдентификаторДляФормул;
  ДопСведение.ИдентификаторДляФормул = ИдентификаторДляФормул;
  ДопСведение.Виден = Ложь;
  ДопСведение.Комментарий = "";
  ДопСведение.ТипЗначения = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(1024));
  ДопСведение.ЭтоДополнительноеСведение = Ложь;
  ДопСведение.Записать();
  
  Возврат ДопСведение.Ссылка;
  
КонецФункции

&НаСервере
Процедура ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	ЗаписатьЗначениеДопРеквизитаСФормы(Объект.Ссылка,АБК_КПС,"АБК_КПС");
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПолучитьПараметрыПроцедуры")
Функция АБК_ПолучитьПараметрыПроцедуры()

	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ШапкаДокумента",			Документы.АктСверкиВзаиморасчетов.ПолучитьСтруктуруШапкиДокумента(Объект));
	ПараметрыПроцедуры.Вставить("СписокОтмеченныхСчетов",	Документы.АктСверкиВзаиморасчетов.ПолучитьСписокОтмеченныхСчетов(Объект)); 
	#Вставка
	///АпогейБК
	Если ЗначениеЗаполнено(ЭтаФорма.АБК_КПС) Тогда
		 ПараметрыПроцедуры.ШапкаДокумента.Вставить("КПС", ЭтаФорма.АБК_КПС);
	Иначе
		 ПараметрыПроцедуры.ШапкаДокумента.Вставить("КПС", Справочники.КлассификационныеПризнакиСчетов.ПустаяСсылка())
	КонецЕсли;
	///АпогейБК 
	#КонецВставки

	Возврат ПараметрыПроцедуры;

КонецФункции
