
//&НаКлиенте
//&После("ДополнитьСтруктуруПодбора1")
//Процедура АБК_ДополнитьСтруктуруПодбора1(ПараметрыПодбора, ДополнительныйПараметр)
//	
//	ПоместитьТаблицуМатериалов(ПараметрыПодбора, ДополнительныйПараметр);
//	
//КонецПроцедуры

&НаСервере
Процедура ПоместитьТаблицуМатериалов(ПараметрыПодбора, ДополнительныйПараметр)
	
	ПодборМатериальныхЗапасов.ПоместитьТаблицаМатериалов(ПараметрыПодбора, ДополнительныйПараметр, Объект);	
	
КонецПроцедуры

&НаСервере
&Перед("ОбработатьВыборПодбораНаСервере")
Процедура АБК_ОбработатьВыборПодбораНаСервере(ВыбранноеЗначение)
	
	ИмяТабличнойЧасти = "";
	
	Если ПодборМатериальныхЗапасов.ПолучитьИмяТабличнойЧастиМатериалы(Объект, ИмяТабличнойЧасти) Тогда
		Объект[ИмяТабличнойЧасти].Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ДополнитьСтруктуруПодбора")
Функция АБК_ДополнитьСтруктуруПодбора()

	СчетУчета = БухгалтерскийУчетВызовСервера.СчетПоКоду("105.00", Объект.Дата, Объект.Организация);

	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("СчетУчета",				СчетУчета);	
	ПараметрыПодбора.Вставить("КФО",					Объект.КФО);
	ПараметрыПодбора.Вставить("ЦМО", 					Объект.ЦМО);
	ПараметрыПодбора.Вставить("Подразделение",			Объект.Подразделение);
	ПараметрыПодбора.Вставить("ПоказыватьОстатки",		Истина);
	ПараметрыПодбора.Вставить("ПоказыватьСчетУчета",	Истина);
	ТипыНоменклатуры = Новый СписокЗначений;
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Блюдо"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.БСО"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ГСМ"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Медикаменты"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МягкийИнвентарь"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Оборудование"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Посуда"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПродуктыПитания"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Продукция"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПрочиеМЗ"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Стройматериалы"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Тара"));
	ПараметрыПодбора.Вставить("ТипыНоменклатуры",		ТипыНоменклатуры);
	ПараметрыПодбора.Вставить("ИмяТаблицы",				"МатериальныеЗапасы");
	ПараметрыПодбора.Вставить("ПредставлениеТаблицы",	"Материальные запасы");

	ДополнительноеСубконтоСчета = УправлениеМатериальнымиЗапасамиКлиентСервер.ДополнительнаяАналитикаСчетаУчетаМатериалов(СчетУчета, Объект.Организация);
	Если ЗначениеЗаполнено(ДополнительноеСубконтоСчета) Тогда
		ПараметрыПодбора.Вставить("ВидСубконтоДополнительнойАналитикиСчета", ДополнительноеСубконтоСчета);
	КонецЕсли;    
	#Вставка
	ПоместитьТаблицуМатериалов(ПараметрыПодбора, Неопределено);
	#КонецВставки
	Возврат ПараметрыПодбора;

КонецФункции
