
&Перед("ВыполнитьНаСторонеЦиклПослеПодписания")
Процедура АБК_ДатаПодписанияВнутрЭДВыполнитьНаСторонеЦиклПослеПодписания(СвойстваПодписи, Контекст)
	Попытка
		Если Контекст.Оповещение.ДополнительныеПараметры.ПараметрыВыполнения.БратьДатуДокумента=Истина Тогда 
			Если Контекст.ЭлементДанных.Свойство("УчетныйДокумент") Тогда
				СвойстваПодписи.ДатаПодписи = АБК_Дополнительные_Функции_ЭДО.ПолучитьДатуУчетногоДокумента(Контекст.ЭлементДанных.УчетныйДокумент);
				СвойстваПодписи.ДатаПроверкиПодписи = АБК_Дополнительные_Функции_ЭДО.ПолучитьДатуУчетногоДокумента(Контекст.ЭлементДанных.УчетныйДокумент);
				Если СвойстваПодписи.Свойство("ДатаПодписиИзМетки") Тогда
					 СвойстваПодписи.ДатаПодписиИзМетки=АБК_Дополнительные_Функции_ЭДО.ПолучитьДатуУчетногоДокумента(Контекст.ЭлементДанных.УчетныйДокумент)
				КонецЕсли; 
				Если СвойстваПодписи.Свойство("НеподтвержденнаяДатаПодписи") Тогда
					 СвойстваПодписи.НеподтвержденнаяДатаПодписи=АБК_Дополнительные_Функции_ЭДО.ПолучитьДатуУчетногоДокумента(Контекст.ЭлементДанных.УчетныйДокумент)
				КонецЕсли;

			КонецЕсли;
		Иначе
				СвойстваПодписи.ДатаПодписи = Контекст.Оповещение.ДополнительныеПараметры.ПараметрыВыполнения.ДатаПодписи;
				СвойстваПодписи.ДатаПроверкиПодписи = Контекст.Оповещение.ДополнительныеПараметры.ПараметрыВыполнения.ДатаПодписи;
				Если СвойстваПодписи.Свойство("ДатаПодписиИзМетки") Тогда
					 СвойстваПодписи.ДатаПодписиИзМетки=Контекст.Оповещение.ДополнительныеПараметры.ПараметрыВыполнения.ДатаПодписи;
				КонецЕсли; 
				Если СвойстваПодписи.Свойство("НеподтвержденнаяДатаПодписи") Тогда
					 СвойстваПодписи.НеподтвержденнаяДатаПодписи=Контекст.Оповещение.ДополнительныеПараметры.ПараметрыВыполнения.ДатаПодписи;
				КонецЕсли;
		КонецЕсли;
	Исключение
		//не требуется
	КонецПопытки;
КонецПроцедуры
