
&НаКлиенте
&ИзменениеИКонтроль("УстановитьВидимостьЭлементовФормы")
Процедура АБК_УстановитьВидимостьЭлементовФормы()

	Приобретение = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПризнанияОС.Приобретение"));
	Изготовление = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПризнанияОС.Изготовление"));
	Модернизация = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПризнанияОС.Модернизация"));
	БезвозмездноеПоступление = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПризнанияОС.БезвозмездноеПоступление"));

	Элементы.СтраницаКапитальныеВложения.Видимость = (Приобретение Или Изготовление Или Модернизация);
	Элементы.КоличествоВложений.Видимость = Не Модернизация;
	Элементы.КоличествоВложений.ТолькоПросмотр = Приобретение;

	Элементы.ОсновныеСредстваСуммаАмортизации.Видимость						= (Не Приобретение И Не Изготовление);
	Элементы.ОсновныеСредстваСуммаОбесценения.Видимость						= (Не Приобретение И Не Изготовление);
	Элементы.ОсновныеСредстваДатаВводаВЭксплуатацию.Видимость				= (Не Приобретение И Не Изготовление);
	Элементы.ОсновныеСредстваОставшийсяСрокПолезногоИспользования.Видимость	= (Не Приобретение И Не Изготовление);

	Элементы.СтраницаРаботы.Видимость = Модернизация;
	Элементы.СтраницаДрагМатериалы.Видимость = Не Модернизация;
	
	#Удаление
	ВидимостьКонтрагента = (ЗначениеЗаполнено(Объект.ДокументОснование) ИЛИ БезвозмездноеПоступление);
	Элементы.Контрагент.Видимость = ВидимостьКонтрагента;
	#КонецУдаления

КонецПроцедуры
