
&НаСервере
Процедура АБК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	РеквизитФормы = Новый РеквизитФормы("КоличествоОстаток", Новый ОписаниеТипов);
	ИзменитьРеквизиты(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РеквизитФормы));
	
	Параметры.Свойство("КоличествоОстаток", ЭтотОбъект["КоличествоОстаток"]);
	
КонецПроцедуры

&НаКлиенте
Процедура АБК_КоличествоПриИзмененииПеред(Элемент)
	
	Если ТипЗнч(ЭтотОбъект["КоличествоОстаток"]) = Тип("Число") Тогда
		Количество = Мин(Количество, ЭтотОбъект["КоличествоОстаток"]);
	КонецЕсли;
	
КонецПроцедуры
