
&ИзменениеИКонтроль("ПроверитьЗаполнениеТабЧастейЗаявкиНаИзменение")
Процедура АБК_ПроверитьЗаполнениеТабЧастейЗаявкиНаИзменение(Отказ, ПроверятьКоличество)
	
	#Вставка
	Возврат;
	#КонецВставки
	ВалютаРеглУчета = ОбщегоНазначенияБГУПовтИсп.ПолучитьВалютуРегламентированногоУчета();

	Для каждого СтрокаТЧ Из РасшифровкаОбязательстваБюджет Цикл

		Если ПроверятьКоличество И СтрокаТЧ.Количество < 0 И СтрокаТЧ.Сумма > 0 Тогда

			ТекстОшибки = НСтр("ru='Поле ""Количество"" в строке %НомерСтроки% списка ""Бюджетные средства"" не может быть отрицательным'");
			ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%НомерСтроки%", СтрокаТЧ.НомерСтроки);
			ПутьКРеквизиту = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РасшифровкаОбязательстваБюджет", СтрокаТЧ.НомерСтроки, "Количество");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, ПутьКРеквизиту,, Отказ );

		ИначеЕсли ПроверятьКоличество И СтрокаТЧ.Сумма = 0 И СтрокаТЧ.Количество > 0 Тогда 

			ТекстОшибки = НСтр("ru='Не заполнено поле ""Сумма"" в строке %НомерСтроки% списка ""Бюджетные средства""'");
			ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%НомерСтроки%", СтрокаТЧ.НомерСтроки);					
			ПутьКРеквизиту = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РасшифровкаОбязательстваБюджет", СтрокаТЧ.НомерСтроки, "Сумма");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, ПутьКРеквизиту,, Отказ);

		ИначеЕсли СтрокаТЧ.Сумма < 0 Тогда 	

			ТекстОшибки = НСтр("ru='Значение поля ""Сумма"" в строке %НомерСтроки% списка ""Бюджетные средства"" не может быть отрицательным'");
			ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%НомерСтроки%", СтрокаТЧ.НомерСтроки);					
			ПутьКРеквизиту = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РасшифровкаОбязательстваБюджет", СтрокаТЧ.НомерСтроки, "Сумма");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, ПутьКРеквизиту,, Отказ);

		КонецЕсли;

		Если СтрокаТЧ.СуммаВВалютеБезусловная < 0 Тогда 	

			ТекстОшибки = НСтр("ru='Значение поля ""в т.ч. безусловно"" в строке %НомерСтроки% списка ""Бюджетные средства"" не может быть отрицательным'");
			ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%НомерСтроки%", СтрокаТЧ.НомерСтроки);					
			ПутьКРеквизиту = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РасшифровкаОбязательстваБюджет", СтрокаТЧ.НомерСтроки, "СуммаВВалютеБезусловная");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, ПутьКРеквизиту,, Отказ);

		КонецЕсли;

		Если ВалютаДокумента <> ВалютаРеглУчета  Тогда

			Если СтрокаТЧ.СуммаВВалюте = 0 И СтрокаТЧ.Сумма > 0 Тогда

				ТекстОшибки = НСтр("ru='Не заполнено поле ""Сумма (в валюте)"" в строке %НомерСтроки% списка ""Бюджетные средства""'");
				ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%НомерСтроки%", СтрокаТЧ.НомерСтроки);
				ПутьКРеквизиту = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РасшифровкаОбязательстваБюджет", СтрокаТЧ.НомерСтроки, "СуммаВВалюте");
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, ПутьКРеквизиту,, Отказ );

			КонецЕсли; 

		КонецЕсли;

	КонецЦикла; 

	Для каждого СтрокаТЧ Из РасшифровкаОбязательстваВнебюджет Цикл

		Если ПроверятьКоличество И СтрокаТЧ.Количество < 0 И СтрокаТЧ.Сумма > 0 Тогда

			ТекстОшибки = НСтр("ru='Поле ""Количество"" в строке %НомерСтроки% списка ""Внебюджетные средства"" не может быть отрицательным'");
			ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%НомерСтроки%", СтрокаТЧ.НомерСтроки);
			ПутьКРеквизиту = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РасшифровкаОбязательстваВнебюджет", СтрокаТЧ.НомерСтроки, "Количество");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, ПутьКРеквизиту,, Отказ );

		ИначеЕсли ПроверятьКоличество И  СтрокаТЧ.Сумма = 0 И СтрокаТЧ.Количество <> 0 Тогда 

			ТекстОшибки = НСтр("ru='Не заполнено поле ""Сумма"" в строке %НомерСтроки% списка ""Внебюджетные средства""'");
			ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%НомерСтроки%", СтрокаТЧ.НомерСтроки);					
			ПутьКРеквизиту = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РасшифровкаОбязательстваВнебюджет", СтрокаТЧ.НомерСтроки, "Сумма");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, ПутьКРеквизиту,, Отказ);

		ИначеЕсли СтрокаТЧ.Сумма < 0 Тогда 	
			
			ТекстОшибки = НСтр("ru='Значение поля ""Сумма"" в строке %НомерСтроки% списка ""Внебюджетные средства"" не может быть отрицательным'");
			ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%НомерСтроки%", СтрокаТЧ.НомерСтроки);					
			ПутьКРеквизиту = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РасшифровкаОбязательстваВнебюджет", СтрокаТЧ.НомерСтроки, "Сумма");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, ПутьКРеквизиту,, Отказ);

		КонецЕсли; 

		Если СтрокаТЧ.СуммаВВалютеБезусловная < 0 Тогда 	

			ТекстОшибки = НСтр("ru='Значение поля ""в т.ч. безусловно"" в строке %НомерСтроки% списка ""Внебюджетные средства"" не может быть отрицательным'");
			ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%НомерСтроки%", СтрокаТЧ.НомерСтроки);					
			ПутьКРеквизиту = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РасшифровкаОбязательстваВнебюджет", СтрокаТЧ.НомерСтроки, "СуммаВВалютеБезусловная");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, ПутьКРеквизиту,, Отказ);

		КонецЕсли;


		Если ВалютаДокумента <> ВалютаРеглУчета  Тогда

			Если СтрокаТЧ.СуммаВВалюте = 0 И СтрокаТЧ.Сумма <> 0 Тогда

				ТекстОшибки = НСтр("ru='Не заполнено поле ""Сумма (в валюте)"" в строке %НомерСтроки% списка ""Внебюджетные средства""'");
				ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%НомерСтроки%", СтрокаТЧ.НомерСтроки);
				ПутьКРеквизиту = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РасшифровкаОбязательстваВнебюджет", СтрокаТЧ.НомерСтроки, "СуммаВВалюте");
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, ПутьКРеквизиту,, Отказ );

			КонецЕсли;

		КонецЕсли;	

	КонецЦикла;

КонецПроцедуры
