


&НаСервере
Процедура АБК_АктСверкиВзаиморасчетов_НесколькоДоговоров_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Элементы.ТаблицаДоговоровДоговор.СвязиПараметровВыбора = Элементы.Договор.СвязиПараметровВыбора;
КонецПроцедуры


&НаСервере
&ИзменениеИКонтроль("ПолучитьПараметрыПроцедуры")
Функция АБК_АктСверкиВзаиморасчетов_НесколькоДоговоров_ПолучитьПараметрыПроцедуры1()

	ШапкаДокумента = Новый Структура("
	|Дата,
	|Организация,
	|Подразделение,
	|КФО,
	|ИФО,
	|БезУчетаИФО,
	|Контрагент,
	|ВалютаДокумента,
	|ДатаНачала,
	|ДатаОкончания,
	|Договор,
	|РазбитьПоДоговорам,
	|ДетализироватьПоДоговорам,
	|ПоВсемОрганизациям");

	ЗаполнитьЗначенияСвойств(ШапкаДокумента, Объект);
	
	#Вставка 
	МассивДоговоров = Новый Массив;
	МассивДоговоров = ТаблицаДоговоров.Выгрузить(,"Договор");
	
	ШапкаДокумента.Вставить("МассивДоговоров",МассивДоговоров);
	#КонецВставки

	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ШапкаДокумента",			ШапкаДокумента);
	ПараметрыПроцедуры.Вставить("СписокОтмеченныхСчетов",	Документы.АктСверкиВзаиморасчетов.ПолучитьСписокОтмеченныхСчетов(Объект));

	Возврат ПараметрыПроцедуры;

КонецФункции

