
&НаСервере
&ИзменениеИКонтроль("ВывестиПредставлениеДокумента")
Процедура АБК_ВывестиПредставлениеДокумента()

	Если Объект.Ссылка.Пустая()
		И НЕ ЗначениеЗаполнено(АдресОсновногоФайла) Тогда
		Возврат;
	КонецЕсли;

	ДвоичныеДанные = ДвоичныеДанныеЭлектронногоДокумента();

	Если ДвоичныеДанные = Неопределено Тогда

		ТабличныйДокументОсновной.Очистить();
		АдресОсновногоФайла = "";
		АдресТабличногоДокумента = "";

		ТекстСообщения = НСтр("ru = 'Не удалось получить данные документа, так как он помечен на удаление.
		|Для продолжения работы с документом необходимо снять пометку удаления.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

		Возврат;

	КонецЕсли;

	АдресОсновногоФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);

	ТабличныйДокументОсновной = ВнутреннийЭДО.ТабличныйДокументИзДвоичныхДанныхАрхива(ДвоичныеДанные);
	
	#Вставка  
	Если Объект.Ссылка.Пустая() Тогда
		Для Каждого Область из ТабличныйДокументОсновной.Области Цикл
			Область.Защита = Ложь;	
		КонецЦикла;
	КонецЕсли;
	#КонецВставки
	
	АдресТабличногоДокумента = ПоместитьВоВременноеХранилище(ТабличныйДокументОсновной, УникальныйИдентификатор);

	ВнутреннийЭДО.ДобавитьШтампыЭлектронныхПодписей(ТабличныйДокументОсновной, ЭлектронныеПодписи, Объект.Организация);

КонецПроцедуры

&НаКлиенте
Процедура АБК_ТабличныйДокументОсновнойПриИзмененииПосле(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура АБК_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтаФорма.Модифицированность = Истина Тогда          
		
		Для Каждого Область из ТабличныйДокументОсновной.Области Цикл
			Область.Защита = Истина;	
		КонецЦикла;
		
		АБК_Параметры = Новый Структура("Организация,УчетныйДокумент,ВидДокумента,ДатаДокумента,ДатаДокумента,
		|НомерДокумента,ИдентификаторКомандыПечати,ТабличныйДокумент");
		АБК_Параметры.Организация = Объект.Организация;
		АБК_Параметры.УчетныйДокумент = Объект.УчетныйДокумент;
		АБК_Параметры.ВидДокумента = Объект.ВидДокумента;
		АБК_Параметры.ДатаДокумента = Объект.ДатаДокумента;
		АБК_Параметры.НомерДокумента = Объект.НомерДокумента;
		АБК_Параметры.ИдентификаторКомандыПечати = Объект.ИдентификаторКомандыПечати;
		АБК_Параметры.ТабличныйДокумент = ТабличныйДокументОсновной;
		
		Описание = ВнутреннийЭДО.АБК_ОписаниеЭлектронногоДокумента(АБК_Параметры);
		
		Если НЕ ЗначениеЗаполнено(Описание.АдресОсновногоФайла) Тогда
			ТекстСообщения = НСтр("ru='Электронный документ выбранного вида не может быть сформирован, проверьте возможность печати соответствующей формы из документа'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		КонецЕсли;
		
		АдресОсновногоФайла = Описание.АдресОсновногоФайла;
		
	КонецЕсли;
КонецПроцедуры


