
&НаКлиенте
Процедура АБК_ЗаполнитьПоТаблицеЛБО_АссгнованияПосле(Команда)
	
	Если Объект.Ассигнования.Количество() > 0 тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "ru = 'Будет произведена очистка таблицы Ассигнований!,
				|Продолжить?'";
		ПоказатьВопрос(Новый ОписаниеОповещения("АБК_ЗаполнитьПоТаблицеЛБОЗавершение", ЭтотОбъект), НСтр(Текст), Режим, 0);
		
		Возврат;
		
	КонецЕсли;	
	
	АБК_ЗаполнитьАссигнованияПоТаблицеЛБО();

КонецПроцедуры

&НаКлиенте
Процедура АБК_ЗаполнитьПоТаблицеЛБОЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
    
    АБК_ЗаполнитьАссигнованияПоТаблицеЛБО();

КонецПроцедуры

&НаКлиенте
Процедура АБК_ЗаполнитьАссигнованияПоТаблицеЛБО()
    
    Объект.Ассигнования.Очистить();
    Для Каждого СтрЛБО Из Объект.ЛБО Цикл
        СтрАссигнования = Объект.Ассигнования.Добавить();
        ЗаполнитьЗначенияСвойств(СтрАссигнования, СтрЛБО);
    КонецЦикла;	
    Модифицированность = Истина;

КонецПроцедуры
