
&НаКлиенте
&ИзменениеИКонтроль("РасшифровкаОбязательстваВнебюджетРазделЛицевогоСчетаНачалоВыбора")
Процедура АБК_РасшифровкаОбязательстваВнебюджетРазделЛицевогоСчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	#Удаление
	Если НЕ ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;

	ТекущаяСтрока = Элементы.РасшифровкаОбязательстваВнебюджет.ТекущиеДанные;
	Элемент.СписокВыбора.ЗагрузитьЗначения(СвойстваЛицевогоСчета.РазделыЛСпоКФО[ТекущаяСтрока.КФО]);
	#КонецУдаления
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("РасшифровкаОбязательстваВнебюджетКФОПриИзменении")
Процедура АБК_РасшифровкаОбязательстваВнебюджетКФОПриИзменении(Элемент)
	#Удаление
	ТекущаяСтрока = Элементы.РасшифровкаОбязательстваВнебюджет.ТекущиеДанные;

	Если ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		МассивДопустимыеРазделыЛС = СвойстваЛицевогоСчета.РазделыЛСпоКФО[ТекущаяСтрока.КФО];
		Если МассивДопустимыеРазделыЛС.Найти(ТекущаяСтрока.РазделЛицевогоСчета) = Неопределено Тогда
			Если МассивДопустимыеРазделыЛС.Количество() > 0 Тогда
				ТекущаяСтрока.РазделЛицевогоСчета = МассивДопустимыеРазделыЛС[0];			
			Иначе
				ТекущаяСтрока.РазделЛицевогоСчета = Неопределено;
			КонецЕсли; 		
		КонецЕсли;
	КонецЕсли;
	#КонецУдаления
КонецПроцедуры

&НаСервере
Процедура АБК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Элементы.РасшифровкаОбязательстваВнебюджетКФО.РежимВыбораИзСписка 					= Ложь;
	Элементы.РасшифровкаОбязательстваВнебюджетРазделЛицевогоСчета.РежимВыбораИзСписка  	= Ложь;
	Элементы.РасшифровкаОбязательстваВнебюджетРазделЛицевогоСчета.КнопкаВыбора			= Истина;
	Элементы.РасшифровкаОбязательстваБюджетКФО.РежимВыбораИзСписка 						= Ложь;
	Элементы.РасшифровкаОбязательстваБюджетРазделЛицевогоСчета.РежимВыбораИзСписка 		= Ложь;
	Элементы.РасшифровкаОбязательстваБюджетРазделЛицевогоСчета.КнопкаВыбора 			= Истина
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("РасшифровкаОбязательстваБюджетКФОНачалоВыбораИзСписка")
Процедура АБК_РасшифровкаОбязательстваБюджетКФОНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	#Удаление
	Если Объект.ЛицевойСчет.Пустая() Тогда
		СтандартнаяОбработка = Ложь;
		Текст = "ru = ""Укажите лицевой счет!""";
		ПоказатьПредупреждение(Неопределено, НСтр(Текст), 10);
	КонецЕсли; 
	#КонецУдаления
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("РасшифровкаОбязательстваБюджетРазделЛицевогоСчетаНачалоВыбора")
Процедура АБК_РасшифровкаОбязательстваБюджетРазделЛицевогоСчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	#Удаление
	ТекущаяСтрока = Элементы.РасшифровкаОбязательстваБюджет.ТекущиеДанные;
	Элемент.СписокВыбора.ЗагрузитьЗначения(СвойстваЛицевогоСчета.РазделыЛСпоКФО[ТекущаяСтрока.КФО]);
	#КонецУдаления
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("УстановитьСпискиВыбораКФО")
Процедура АБК_УстановитьСпискиВыбораКФО()
	#Удаление
	Элементы.РасшифровкаОбязательстваБюджетКФО.СписокВыбора.ЗагрузитьЗначения(СвойстваЛицевогоСчета.КФОпоЛСБюджет);
	Элементы.РасшифровкаОбязательстваБюджетКФО.СписокВыбора.СортироватьПоЗначению();

	Если ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		Элементы.РасшифровкаОбязательстваВнебюджетКФО.СписокВыбора.ЗагрузитьЗначения(СвойстваЛицевогоСчета.КФОпоЛСВнебюджет);	
	Иначе	
		Элементы.РасшифровкаОбязательстваВнебюджетКФО.СписокВыбора.ЗагрузитьЗначения(ДопустимыекКФООрганизации.ВыгрузитьЗначения());
	КонецЕсли;	
	Элементы.РасшифровкаОбязательстваВнебюджетКФО.СписокВыбора.СортироватьПоЗначению();
	#КонецУдаления
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("УстановитьВидимостьПоТипуОрганизации")
Процедура АБК_УстановитьВидимостьПоТипуОрганизации()
	
	#Удаление
	Элементы.ГруппаСтраницаРасшифровкаОбязательстваБюджет.Видимость = (ЭтоБюджетополучатель ИЛИ Объект.РасшифровкаОбязательстваБюджет.Количество() > 0); 
	Элементы.ГруппаСтраницаПримечаниеБюджет.Видимость = (ЭтоБюджетополучатель ИЛИ Объект.РасшифровкаОбязательстваБюджет.Количество() > 0); 

	Элементы.ГруппаСтраницаРасшифровкаОбязательстваПД.Видимость = (НЕ ЭтоБюджетополучатель ИЛИ Объект.РасшифровкаОбязательстваВнебюджет.Количество() > 0);
	#КонецУдаления
	
	Элементы.РасшифровкаОбязательстваБюджетПодразделение.Видимость = УчетПоПодразделениям;
	Элементы.РасшифровкаОбязательстваВнебюджетПодразделение.Видимость = УчетПоПодразделениям;

	УстановитьВидимостьОрганаКазначейства();

КонецПроцедуры

&НаКлиенте
Процедура АБК_РасшифровкаОбязательстваБюджетПередНачаломДобавленияВместо(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура АБК_РасшифровкаОбязательстваВнебюджетПередНачаломДобавленияВместо(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура АБК_РасшифровкаОбязательстваБюджетКФОПриИзмененииВместо(Элемент)
	
	ТекущаяСтрока = Элементы.РасшифровкаОбязательстваБюджет.ТекущиеДанные;
	
	МассивДопустимыеРазделыЛС = СвойстваЛицевогоСчета.РазделыЛСпоКФО[ТекущаяСтрока.КФО]; 
	Если МассивДопустимыеРазделыЛС <> Неопределено Тогда
		Если МассивДопустимыеРазделыЛС.Найти(ТекущаяСтрока.РазделЛицевогоСчета) = Неопределено Тогда
			Если МассивДопустимыеРазделыЛС.Количество() > 0 Тогда
				ТекущаяСтрока.РазделЛицевогоСчета = МассивДопустимыеРазделыЛС[0];			
			Иначе
				ТекущаяСтрока.РазделЛицевогоСчета = Неопределено;
			КонецЕсли; 		
		КонецЕсли;              
	Иначе
		ТекущаяСтрока.РазделЛицевогоСчета = Неопределено;
	КонецЕсли;
	
КонецПроцедуры
