
&ИзменениеИКонтроль("ЕстьФункцияПодготовитьТаблицуСписаниеМатериальныхЗапасовПоДокументуВМенеджере")
Функция АБК_ЕстьФункцияПодготовитьТаблицуСписаниеМатериальныхЗапасовПоДокументуВМенеджере(Документ)
	ТипДокумента = ТипЗнч(Документ);
	Возврат ТипДокумента = Тип("ДокументОбъект.АктОбУтилизацииМЗ")
	Или ТипДокумента = Тип("ДокументОбъект.АктОбУтилизацииМЗИК")
	Или (ТипДокумента = Тип("ДокументОбъект.ПоступлениеМЗ")
	И Документ.ВидПоступленияМЗ = Перечисления.ВидыПоступленийМЗ.ВозвратИзЛичногоПользования)
	Или ТипДокумента = Тип("ДокументОбъект.РешениеОбОценкеИмуществаМЗ")
	Или ТипДокумента = Тип("ДокументОбъект.АктСписанияИК")
	Или ТипДокумента = Тип("ДокументОбъект.АктСписанияМЗ")
	Или ТипДокумента = Тип("ДокументОбъект.ТребованиеНакладнаяИК")
	#Вставка
	Или ТипДокумента = Тип("ДокументОбъект.АктСписанияМягкогоИХозИнвентаря")
	#КонецВставки
	Или ТипДокумента = Тип("ДокументОбъект.НакладнаяНаОтпускИК");
КонецФункции
