
&НаСервере
Процедура АБК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если Элементы.Найти("СохранитьPDF_СВизуализированнойПодписью") = Неопределено Тогда
		НовЭлКоманды = Элементы.Добавить("СохранитьPDF_СВизуализированнойПодписью",Тип("КнопкаФормы"),Элементы.ФормаГруппаКомандЭлектроннаяПодпись);
		НовЭлКоманды.ИмяКоманды = "СохранитьPDF_СВизуализированнойПодписью";
		НовЭлКоманды.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодменитьФайлНаФайлСВизуализацией(ДанныеФайла, УникальныйИдентификатор) 
	ЭлектронныеДокументыЭДО.ПодменитьФайлНаФайлСВизуализацией_ВнутреннийЭДО(ДанныеФайла, УникальныйИдентификатор);	
КонецПроцедуры

&НаКлиенте
Процедура АБК_СохранитьPDF_СВизуализированнойПодписьюПосле(Команда)
	Если НЕ ФайловыеКомандыДоступны() Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = ТекущиеДанные();
	
	Если ТекущиеДанные.Зашифрован
		ИЛИ (ТекущиеДанные.ФайлРедактируется И ТекущиеДанные.ФайлРедактируетТекущийПользователь) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляСохранения(ТекущиеДанные.Ссылка, , УникальныйИдентификатор);
	
	ПодменитьФайлНаФайлСВизуализацией(ДанныеФайла, УникальныйИдентификатор);	
	
	РаботаСФайламиСлужебныйКлиент.СохранитьКак(Неопределено, ДанныеФайла, Неопределено);
КонецПроцедуры
