
&После("ПриНачалеРаботыСистемы")
Процедура АБК_ПриНачалеРаботыСистемы()
	ПодключитьОбработчикОжидания("АБК_ПроверитьПодписаниеВнутреннихЭДО", 60);
КонецПроцедуры

Процедура АБК_ПроверитьПодписаниеВнутреннихЭДО() Экспорт 
	
МассивДокументов = АБК_ОповещениеВЭДО.НайтиНеподписанныеВнутренниеЭДО();

Если НЕ МассивДокументов.Количество() Тогда 
	Возврат
КонецЕсли;

Для Каждого Эл Из МассивДокументов Цикл 

	НаигационнаяСсылка = ПолучитьНавигационнуюСсылку(Эл.Документ);
	ПоказатьОповещениеПользователя("Требуется подписание внутреннего ЭДО", НаигационнаяСсылка, Эл.Документ,
	БиблиотекаКартинок.ЭмблемаСервиса1СЭДО48, СтатусОповещенияПользователя.Важное, Эл.ИдентификаторСообщения);
	
КонецЦикла;

КонецПроцедуры

