
&После("ПередЗаписью")
Процедура АБК_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(Комментарий)
		И ЗначениеЗаполнено(УчетныйДокумент)
		И ТипЗнч(УчетныйДокумент) = Тип("ДокументСсылка.РегистрУчета") Тогда
		
		ЭлементыНастроек = УчетныйДокумент.ПользовательскиеНастройкиОтчета.Получить().Элементы;
		
		Для Каждого Стр из ЭлементыНастроек Цикл
			Если Строка(Стр.Параметр) = "Счет" Тогда
				Комментарий = ?(ЗначениеЗаполнено(Комментарий), Комментарий + ", ","") + "Счет " + Стр.Значение;	
			КонецЕсли;     
			
			Если Строка(Стр.Параметр) = "Период" Тогда
				Комментарий = ?(ЗначениеЗаполнено(Комментарий), Комментарий + ", ","") + "Период " + Стр.Значение;	
			КонецЕсли;
		КонецЦикла;        
		
	КонецЕсли;
КонецПроцедуры
