
&НаСервере
Процедура АБК_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)  
	Если Параметры.Ключ.Пустая() Тогда
		АБК_ДобавитьЭлементыЗачетаАвансаПоДокументамИОстаткам();    
	КонецЕсли;
КонецПроцедуры                                                      

&НаСервере
Процедура АБК_ПриЧтенииНаСервереПеред(ТекущийОбъект)
	АБК_ДобавитьЭлементыЗачетаАвансаПоДокументамИОстаткам();
КонецПроцедуры

&НаСервере
Процедура АБК_ДобавитьЭлементыЗачетаАвансаПоДокументамИОстаткам()
	Если Элементы.Найти("ЗачетАвансовПоДокументамИОстаткам_Страница") = Неопределено Тогда
		
		НовСтраница = Элементы.Вставить("ЗачетАвансовПоДокументамИОстаткам_Страница",Тип("ГруппаФормы"),Элементы.ЗачетАвансов_Страницы);
		НовСтраница.Вид = ВидГруппыФормы.Страница;
		НовСтраница.Заголовок = "Зачет авансов по документам и остаткам";
		
		НовТаблица = Элементы.Добавить("ЗачетАвансовПоДокументамИОстаткам", Тип("ТаблицаФормы"),НовСтраница);
		НовТаблица.ПутьКДанным = "Объект.ЗачетАвансовПоДокументамИОстаткам";
		
		НовЭл = Элементы.Добавить("ЗачетАвансовПоДокументамИОстаткам_ДокументАванса",Тип("ПолеФормы"),НовТаблица);
		НовЭл.ПутьКДанным = "Объект.ЗачетАвансовПоДокументамИОстаткам.ДокументАванса";
		НовЭл.Вид = ВидПоляФормы.ПолеВвода; 
		НовЭл.УстановитьДействие("НачалоВыбора","ЗачетАвансовПоДокументамИОстаткамДокументАвансаНачалоВыбора");
		НовЭл.УстановитьДействие("ОбработкаВыбора","ЗачетАвансовПоДокументамИОстаткамДокументАвансаОбработкаВыбора");
		
		НовЭл = Элементы.Добавить("ЗачетАвансовПоДокументамИОстаткам_КФО",Тип("ПолеФормы"),НовТаблица);
		НовЭл.ПутьКДанным = "Объект.ЗачетАвансовПоДокументамИОстаткам.КФО";
		НовЭл.Вид = ВидПоляФормы.ПолеВвода;
		
		НовЭл = Элементы.Добавить("ЗачетАвансовПоДокументамИОстаткам_КПС",Тип("ПолеФормы"),НовТаблица);
		НовЭл.ПутьКДанным = "Объект.ЗачетАвансовПоДокументамИОстаткам.КПС";
		НовЭл.Вид = ВидПоляФормы.ПолеВвода;
		
		НовЭл = Элементы.Добавить("ЗачетАвансовПоДокументамИОстаткам_КЭК",Тип("ПолеФормы"),НовТаблица);
		НовЭл.ПутьКДанным = "Объект.ЗачетАвансовПоДокументамИОстаткам.КЭК";
		НовЭл.Вид = ВидПоляФормы.ПолеВвода;
		
		НовЭл = Элементы.Добавить("ЗачетАвансовПоДокументамИОстаткам_ДополнительнаяАналитикаСчета",Тип("ПолеФормы"),НовТаблица);
		НовЭл.ПутьКДанным = "Объект.ЗачетАвансовПоДокументамИОстаткам.ДопСубконтоАвансов";
		НовЭл.Вид = ВидПоляФормы.ПолеВвода;
		
		НовЭл = Элементы.Добавить("ЗачетАвансовПоДокументамИОстаткам_СуммаЗачета",Тип("ПолеФормы"),НовТаблица);
		НовЭл.ПутьКДанным = "Объект.ЗачетАвансовПоДокументамИОстаткам.СуммаЗачета";
		НовЭл.Вид = ВидПоляФормы.ПолеВвода;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансовПоДокументамИОстаткамДокументАвансаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	УчетРасчетовКлиент.АБК_ДокументАвансаПоДокументамИОстаткамНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансовПоДокументамИОстаткамДокументАвансаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	
	УчетРасчетовКлиент.АБК_ДокументАвансаПоДокументамИОстаткамОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, ЭтаФорма, Объект);
	
КонецПроцедуры

