
Функция СуммаНачисленнойКомпенсацииЗаПериод(Дата1, Дата2, Ребенок, Договор)  Экспорт
	Если НЕ ДатыЗаполненыКорректно(Дата1, Дата2) Тогда
		Возврат 0;
	КонецЕсли;

	Если Не (ЗначениеЗаполнено(Ребенок) Или ЗначениеЗаполнено(Договор)) Тогда
		Возврат 0;
	КонецЕсли;

	РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ребенок, "Организация, Контрагент");

	СуммаНачисленияЗаПериод = АБК_ПолучитьТаблицуКомпенсацийПоРебенку(РеквизитыОбъекта.Организация, Ребенок, Дата1, Дата2);
	Возврат СуммаНачисленияЗаПериод;

КонецФункции   

Функция АБК_ПолучитьТаблицуКомпенсацийПоРебенку(Организация, Ребенок, Дата1, Дата2)

	Запрос = Новый Запрос("ВЫБРАТЬ
	|	УчетКомпенсацииРодительскойПлатыОбороты.НачалоПериода КАК НачалоПериода,
	|	УчетКомпенсацииРодительскойПлатыОбороты.СуммаКомпенсацииОборот КАК СуммаКомпенсацииОборот
	|ИЗ
	|	РегистрНакопления.УчетКомпенсацииРодительскойПлаты.Обороты(
	|			&НачалоГода,
	|			&КонецГода,
	|			,
	|			Организация = &Организация
	|				И Ребенок = &Ребенок
	|				И НачалоПериода = &НачалоПериода) КАК УчетКомпенсацииРодительскойПлатыОбороты");
	Запрос.Параметры.Вставить("НачалоГода", 	НачалоГода(Дата1));
	Запрос.Параметры.Вставить("КонецГода", 		КонецГода(Дата2));
	Запрос.Параметры.Вставить("НачалоПериода", 	НачалоМесяца(Дата1));
	Запрос.Параметры.Вставить("Организация", 	Организация);
	Запрос.Параметры.Вставить("Ребенок",		Ребенок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаКомпенсацииОборот;	
	Иначе
		Возврат 0;	
	КонецЕсли; 
		
КонецФункции
      