
&Перед("ВыполнитьНаСторонеЦиклПослеПодписания")
Процедура АБК_ДатаПодписанияВнутрЭДВыполнитьНаСторонеЦиклПослеПодписания(СвойстваПодписи, Контекст)
	Попытка
		Если Контекст.ЭлементДанных.Свойство("Ссылка")
			И Контекст.Форма.Элементы.Найти("ИспользоватьДатуДокумента") <> Неопределено
			И Контекст.Форма.ИспользоватьДатуДокумента Тогда 
			
			СвойстваПодписи.ДатаПодписи = АБК_ДополнительныеФункцииЭДО.ПолучитьДатуУчетногоДокумента(Контекст.ЭлементДанных.Ссылка);
			СвойстваПодписи.ДатаПроверкиПодписи = АБК_ДополнительныеФункцииЭДО.ПолучитьДатуУчетногоДокумента(Контекст.ЭлементДанных.Ссылка);
			Если СвойстваПодписи.Свойство("ДатаПодписиИзМетки") Тогда
				СвойстваПодписи.ДатаПодписиИзМетки = АБК_ДополнительныеФункцииЭДО.ПолучитьДатуУчетногоДокумента(Контекст.ЭлементДанных.Ссылка);
			КонецЕсли; 
			Если СвойстваПодписи.Свойство("НеподтвержденнаяДатаПодписи") Тогда
				СвойстваПодписи.НеподтвержденнаяДатаПодписи = АБК_ДополнительныеФункцииЭДО.ПолучитьДатуУчетногоДокумента(Контекст.ЭлементДанных.Ссылка)
			КонецЕсли; 
			
		ИначеЕсли Контекст.Форма.Элементы.Найти("ДатаПодписи") <> Неопределено
			И ЗначениеЗаполнено(Контекст.Форма.ДатаПодписи) Тогда 
			
			СвойстваПодписи.ДатаПодписи = Контекст.Форма.ДатаПодписи;
			СвойстваПодписи.ДатаПроверкиПодписи = Контекст.Форма.ДатаПодписи;
			Если СвойстваПодписи.Свойство("ДатаПодписиИзМетки") Тогда
				СвойстваПодписи.ДатаПодписиИзМетки = Контекст.Форма.ДатаПодписи;
			КонецЕсли; 
			Если СвойстваПодписи.Свойство("НеподтвержденнаяДатаПодписи") Тогда
				СвойстваПодписи.НеподтвержденнаяДатаПодписи = Контекст.Форма.ДатаПодписи;
			КонецЕсли; 
			
		КонецЕсли;
	Исключение
		//не требуется
	КонецПопытки;
КонецПроцедуры


Функция ПолучитьДатуУчетногоДокумента(ДокументСсылка) Экспорт
	Возврат ДокументСсылка.Дата;
КонецФункции