
&НаСервере
Процедура АБК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ЭлементПодобратьПоНомерам = Элементы.Вставить("СоставБСОПодобратьПоНомерам", Тип("КнопкаФормы"), Элементы.СоставБСО.КоманднаяПанель,Элементы.СоставБСОПодобрать); 
	ЭлементПодобратьПоНомерам.Вид = ВидКнопкиФормы.ОбычнаяКнопка; 
	ЭлементПодобратьПоНомерам.Доступность = Истина;
	ЭлементПодобратьПоНомерам.ИмяКоманды = "ПодобратьПоНомерам";
	
КонецПроцедуры

&НаКлиенте
Процедура АБК_ПодобратьПоНомерамПосле(Команда)
	
	ОтборПодбора = УправлениеМатериальнымиЗапасамиКлиент.ПолучитьСтруктуруПараметровПодбораБСО();
	ОтборПодбора.Организация	= Объект.Организация;
	ОтборПодбора.ЦМО			= Объект.ЦМО;
	ОтборПодбора.КФО			= Объект.КФО;
	ОтборПодбора.ИФО			= Объект.ИФО;
	ОтборПодбора.СчетУчета		= Объект.СчетУчета;
	
	Форма = ЭтотОбъект;
	АдресВХранилище = ПоместитьТЧВХранилище();
	Отбор = ОтборПодбора;
	
	Если ТипЗнч(Отбор) = Тип("Структура") Тогда
		Если Отбор.Свойство("ИФО") И НЕ ОбщегоНазначенияБГУПовтИсп.ЗначениеФункциональнойОпции("ИспользоватьУчетПоИФО") Тогда
			Отбор.Удалить("ИФО");
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Отбор, ДатаОстатков, АдресВХранилище", Отбор, ?(Объект.Ссылка.Пустая(), КонецДня(Объект.Дата), Объект.Дата), АдресВХранилище);
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ВнутреннееПеремещениеБСО") Тогда
		ПараметрыФормы.Вставить("ЦМО", Объект.ЦМООтправитель);
		ПараметрыФормы.Вставить("Подразделение", Объект.ПодразделениеОтправитель);
	Иначе
		ПараметрыФормы.Вставить("ЦМО", Объект.ЦМО);
		ПараметрыФормы.Вставить("Подразделение", Объект.Подразделение);
	КонецЕсли;		
	ПараметрыФормы.Вставить("ИФО", Объект.ИФО);
	ПараметрыФормы.Вставить("КФО", Объект.КФО);
	ПараметрыФормы.Вставить("СчетУчета", Отбор.СчетУчета); 
	// Апогей БК
	ПараметрыФормы.Вставить("ПодборПоНомерам", Истина);
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрыФормы.Вставить("ДокументПодбора", Объект.Ссылка);	
	КонецЕсли;
	// Апогей БК
    ОткрытьФорму("Справочник.БСО.Форма.ФормаПодбора", ПараметрыФормы, Форма);
	
КонецПроцедуры
