
//&НаКлиенте
//&После("ДополнитьСтруктуруПодбора1")
//Процедура АБК_ДополнитьСтруктуруПодбора1(ПараметрыПодбора, ДополнительныйПараметр)
//	
//	ПоместитьТаблицуМатериалов(ПараметрыПодбора, ДополнительныйПараметр);
//	
//КонецПроцедуры

&НаСервере
Процедура ПоместитьТаблицуМатериалов(ПараметрыПодбора, ДополнительныйПараметр)
	
	ПодборМатериальныхЗапасов.ПоместитьТаблицаМатериалов(ПараметрыПодбора, ДополнительныйПараметр, Объект);	
	
КонецПроцедуры

&НаСервере
&Перед("ОбработатьВыборПодбораНаСервере")
Процедура АБК_ОбработатьВыборПодбораНаСервере(ВыбранноеЗначение)
	
	ИмяТабличнойЧасти = "";
	
	Если ПодборМатериальныхЗапасов.ПолучитьИмяТабличнойЧастиМатериалы(Объект, ИмяТабличнойЧасти) Тогда
		Объект[ИмяТабличнойЧасти].Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ДополнитьСтруктуруПодбора")
Функция АБК_ДополнитьСтруктуруПодбора()

	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("СчетУчета",				Объект.СчетУчета);
	ПараметрыПодбора.Вставить("КФО",					Объект.КФО);
	ПараметрыПодбора.Вставить("ЦМО", 					Объект.ЦМООтправитель);
	ПараметрыПодбора.Вставить("Подразделение",			Объект.ПодразделениеОтправитель);
	ПараметрыПодбора.Вставить("ПоказыватьОстатки",		Истина);
	ПараметрыПодбора.Вставить("ПоказыватьСчетУчета",	Истина);
	ТипыНоменклатуры = Новый СписокЗначений;
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МягкийИнвентарь"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Посуда"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПрочиеМЗ"));
	ПараметрыПодбора.Вставить("ТипыНоменклатуры",		ТипыНоменклатуры);
	ПараметрыПодбора.Вставить("ИмяТаблицы",				"Материалы");

	Если СчетУчета27(ЭтотОбъект) Тогда
		ПараметрыПодбора.Вставить("ПодборОстатковВПользовании", Истина);
		ПараметрыПодбора.Вставить("СчетОстатковВПользовании", Объект.СчетУчета);
	КонецЕсли;

	Если Объект.ВыдатьВЛичноеПользование Тогда
		ПараметрыПодбора.Вставить("ВладелецНормыВыдачи", Объект.ПолучательИмущества);
	КонецЕсли;

	ДополнительноеСубконтоСчета = УправлениеМатериальнымиЗапасамиКлиентСервер.ДополнительнаяАналитикаСчетаУчетаМатериалов(Объект.СчетУчета, Объект.Организация);
	Если ЗначениеЗаполнено(ДополнительноеСубконтоСчета) Тогда
		ПараметрыПодбора.Вставить("ВидСубконтоДополнительнойАналитикиСчета", ДополнительноеСубконтоСчета);
	КонецЕсли; 
	#Вставка
	ПоместитьТаблицуМатериалов(ПараметрыПодбора, Неопределено);	
	#КонецВставки
	Возврат ПараметрыПодбора;

КонецФункции
