
&НаСервере
Процедура АБК_УчетСтудентов4014хПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если АБК_УчетСтудентов.ИспользуетсяУчет4014х() тогда
		
		МассивСчетов = Новый Массив;
		МассивСчетов.Добавить("401.41");
		
		ПараметрыВыбораСчетаДБП = Новый Массив;
		
		ПараметрВыбора = Новый ПараметрВыбора("ОграниченияСписокСчетов", МассивСчетов);
		ПараметрыВыбораСчетаДБП.Добавить(ПараметрВыбора);
		
		ПараметрВыбора = Новый ПараметрВыбора("Отбор.ЭлементГруппа", Ложь);
		ПараметрыВыбораСчетаДБП.Добавить(ПараметрВыбора);
		
		Элементы.СчетДБП.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораСчетаДБП);
		
		//Сумма 401.49
		Колонка40149 = Элементы.Вставить("Сумма40149", Тип("ПолеФормы"), Элементы.Начисления, Элементы.НачисленияСтавкаНДС);
		Колонка40149.Вид = ВидПоляФормы.ПолеВвода;
		Колонка40149.Заголовок = "Сумма 401.49";
		Колонка40149.ПутьКДанным = "Объект.Начисления.Сумма40149";
		
	КонецЕсли;
	
КонецПроцедуры
